devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP512GM710/i2cmem.c
/* *****************************************************************************
 * File:   i2cmem.c
 * Author: Dimitar Lilov
 *
 * Created on 2019 02 05 11:42
 * 
 * Description: I2C Interface To External RTCC Memory
 * 
 **************************************************************************** */


/* *****************************************************************************
 * Header Includes
 **************************************************************************** */
#include <xc.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>
#include "hmdrv.h"
#include "i2cmem.h"
#include "boardcfg.h"

#ifdef BOARDCFG_USE_MCC_I2C  
#include "i2c1.h"
#include "i2c2.h"
#endif

/* *****************************************************************************
 * Configuration and General Definitions and Constants
 **************************************************************************** */
#define USE_I2C_ISR         1

#define I2CMEM_MCP79410_7BIT    0x6F            /* 0xDE / 2         -> 111 ( MCP79410-I/MS ) */  
#define I2CMEM_DS3231MZ_7BIT    0x68            /* 0xD0 / 2         -> 104 ( DS3231MZ ) */  

#if 1
#define RTCC_SRAM_ADDR_7BIT     I2CMEM_DS3231MZ_7BIT
#else
#define RTCC_SRAM_ADDR_7BIT     I2CMEM_MCP79410_7BIT
#endif
#define EEPROM_ADDR_7BIT        0x57            /* 0xAE / 2         ->  87 */  
#define PICAUX_ADDR_7BIT        0x16            /* 0x16 for pic16   ->  22 */  
#define FLIR_ADDR_7BIT          0x2A            /* 0x2A             ->  42 */  

#define EXT_MEM_RTCC_SRAM_ADDRESS_OFFSET    0x20

#if USE_SPI_FLIR
#define I2C_WRITE_REVERSE_ORDER_LSB_MSB     0
#endif

#define MCC_I2C_TRANSACTION_BLOCK_BUFFER_LENGTH  64

#define Fi2c            100000      /* Hz */
#define Fi2cDelay       130         /* nSec */
      
#define I2C_MAX_RETRY   3
#define ONE_BYTE        1
#define TWO_BYTE        2

#define I2C_ADDRWIDTH   ONE_BYTE    /* ADDRESS SIZE */

/* *****************************************************************************
 * Enumeration Definitions
 **************************************************************************** */


#if USE_SPI_FLIR
/* *****************************************************************************
 * Lepton Flir Camera usage.Represents the different result codes the camera can return.
 **************************************************************************** */
typedef enum Result
{
    LEP_OK                              = 0,        /* Camera ok */
    LEP_COMM_OK                         = LEP_OK,   /* Camera comm ok (same as LEP_OK) */
    LEP_ERROR                           = -1,       /* Camera general error */
    LEP_NOT_READY                       = -2,       /* Camera not ready error */
    LEP_RANGE_ERROR                     = -3,       /* Camera range error */
    LEP_CHECKSUM_ERROR                  = -4,       /* Camera checksum error */
    LEP_BAD_ARG_POINTER_ERROR           = -5,       /* Camera Bad argument error */
    LEP_DATA_SIZE_ERROR                 = -6,       /* Camera byte count error */
    LEP_UNDEFINED_FUNCTION_ERROR        = -7,       /* Camera undefined function error */
    LEP_FUNCTION_NOT_SUPPORTED          = -8,       /* Camera function not yet supported error */
    LEP_DATA_OUT_OF_RANGE_ERROR         = -9,       /* Camera range error *//* Camera input DATA is out of valid range error */
    LEP_COMMAND_NOT_ALLOWED             = -11,      /* Camera unable to execute command due to current camera state */
    /* OTP access errors */
    LEP_OTP_WRITE_ERROR                 = -15,      /*!< Camera OTP write error */
    LEP_OTP_READ_ERROR                  = -16,      /* double bit error detected (uncorrectible) */
    LEP_OTP_NOT_PROGRAMMED_ERROR        = -18,      /* Flag read as non-zero */
    /* I2C Errors */     
    LEP_ERROR_I2C_BUS_NOT_READY         = -20,      /* I2C Bus Error - Bus Not Avaialble */
    LEP_ERROR_I2C_BUFFER_OVERFLOW       = -22,      /* I2C Bus Error - Buffer Overflow */
    LEP_ERROR_I2C_ARBITRATION_LOST      = -23,      /* I2C Bus Error - Bus Arbitration Lost */
    LEP_ERROR_I2C_BUS_ERROR             = -24,      /* I2C Bus Error - General Bus Error */
    LEP_ERROR_I2C_NACK_RECEIVED         = -25,      /* I2C Bus Error - NACK Received */
    LEP_ERROR_I2C_FAIL                  = -26,      /* I2C Bus Error - General Failure */
    /* Processing Errors */
    LEP_DIV_ZERO_ERROR                  = -80,      /* Attempted div by zero */
    /* Comm Errors */
    LEP_COMM_PORT_NOT_OPEN              = -101,     /* Comm port not open */
    LEP_COMM_INVALID_PORT_ERROR         = -102,     /* Comm port no such port error */
    LEP_COMM_RANGE_ERROR                = -103,     /* Comm port range error */
    LEP_ERROR_CREATING_COMM             = -104,     /* Error creating comm */
    LEP_ERROR_STARTING_COMM             = -105,     /* Error starting comm */
    LEP_ERROR_CLOSING_COMM              = -106,     /* Error closing comm */
    LEP_COMM_CHECKSUM_ERROR             = -107,     /* Comm checksum error */
    LEP_COMM_NO_DEV                     = -108,     /* No comm device */
    LEP_TIMEOUT_ERROR                   = -109,     /* Comm timeout error */
    LEP_COMM_ERROR_WRITING_COMM         = -110,     /* Error writing comm */
    LEP_COMM_ERROR_READING_COMM         = -111,     /* Error reading comm */
    LEP_COMM_COUNT_ERROR                = -112,     /* Comm byte count error */
    /* Other Errors */    
    LEP_OPERATION_CANCELED              = -126,     /* Camera operation canceled */
    LEP_UNDEFINED_ERROR_CODE            = -127      /* Undefined error */
} LEP_RESULT;

typedef enum 
{
    FLIR_BIT_POS_STA_LO_BUSY = 0x01,
            
    FLIR_BIT_POS_COUNT       
}eFlirI2CRegBitPos_t;



typedef enum 
{
    FLIR_ADR_REG_POW    = 0x0000,
    FLIR_ADR_REG_STA    = 0x0002,
    FLIR_ADR_REG_STA_LO = 0x0002,
    FLIR_ADR_REG_STA_HI = 0x0003,
    FLIR_ADR_REG_CMD    = 0x0004,
    FLIR_ADR_REG_LEN    = 0x0006,
    FLIR_ADR_REG_D00    = 0x0008,
    FLIR_ADR_REG_D01    = 0x000A,
    FLIR_ADR_REG_D02    = 0x000C,
    FLIR_ADR_REG_D03    = 0x000E,
    FLIR_ADR_REG_D04    = 0x0010,
    FLIR_ADR_REG_D05    = 0x0012,
    FLIR_ADR_REG_D06    = 0x0014,
    FLIR_ADR_REG_D07    = 0x0016,
    FLIR_ADR_REG_D08    = 0x0018,
    FLIR_ADR_REG_D09    = 0x001A,
    FLIR_ADR_REG_D10    = 0x001C,
    FLIR_ADR_REG_D11    = 0x001E,
    FLIR_ADR_REG_D12    = 0x0020,
    FLIR_ADR_REG_D13    = 0x0022,
    FLIR_ADR_REG_D14    = 0x0024,
    FLIR_ADR_REG_D15    = 0x0026,
            
