devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP512GM710/i2cmem.c
    FLIR_ADR_REG_END    = 0xFFFF,
}eFlirI2CAdrReg_t;


typedef enum 
{
    FLIR_ADR_REG_16BIT_POW    = FLIR_ADR_REG_POW/2,
    FLIR_ADR_REG_16BIT_STA    = FLIR_ADR_REG_STA/2,
    FLIR_ADR_REG_16BIT_CMD    = FLIR_ADR_REG_CMD/2,
    FLIR_ADR_REG_16BIT_LEN    = FLIR_ADR_REG_LEN/2,
    FLIR_ADR_REG_16BIT_D00    = FLIR_ADR_REG_D00/2,
    FLIR_ADR_REG_16BIT_D01    = FLIR_ADR_REG_D01/2,
    FLIR_ADR_REG_16BIT_D02    = FLIR_ADR_REG_D02/2,
    FLIR_ADR_REG_16BIT_D03    = FLIR_ADR_REG_D03/2,
    FLIR_ADR_REG_16BIT_D04    = FLIR_ADR_REG_D04/2,
    FLIR_ADR_REG_16BIT_D05    = FLIR_ADR_REG_D05/2,
    FLIR_ADR_REG_16BIT_D06    = FLIR_ADR_REG_D06/2,
    FLIR_ADR_REG_16BIT_D07    = FLIR_ADR_REG_D07/2,
    FLIR_ADR_REG_16BIT_D08    = FLIR_ADR_REG_D08/2,
    FLIR_ADR_REG_16BIT_D09    = FLIR_ADR_REG_D09/2,
    FLIR_ADR_REG_16BIT_D10    = FLIR_ADR_REG_D10/2,
    FLIR_ADR_REG_16BIT_D11    = FLIR_ADR_REG_D11/2,
    FLIR_ADR_REG_16BIT_D12    = FLIR_ADR_REG_D12/2,
    FLIR_ADR_REG_16BIT_D13    = FLIR_ADR_REG_D13/2,
    FLIR_ADR_REG_16BIT_D14    = FLIR_ADR_REG_D14/2,
    FLIR_ADR_REG_16BIT_D15    = FLIR_ADR_REG_D15/2,
            
    FLIR_ADR_REG_16BIT_END    = 0xFFFF,
}eFlirI2CAdrReg16Bit_t;



typedef enum
{
    FLIR_I2C_STA_IDLE,
    FLIR_I2C_STA_GET_STA_001,
    FLIR_I2C_STA_SET_REG_CNT,
    FLIR_I2C_STA_SET_CMD_REG,
    FLIR_I2C_STA_GET_STA_002,
    FLIR_I2C_STA_GET_DAT_BUF,
    FLIR_I2C_STA_SET_DAT_BUF,
    FLIR_I2C_STA_ERR,
    FLIR_I2C_STA_DONE,
            
    FLIR_I2C_STA_COUNT            
    
}eFlirI2CSta_t;

#endif

typedef enum 
{
    I2C_CTRL_BYTE_RTCC_SRAM    = (RTCC_SRAM_ADDR_7BIT << 1),  /* RD or WR made in the Command Function Call */
    I2C_CTRL_BYTE_RTCC_SRAM_WR = (RTCC_SRAM_ADDR_7BIT << 1),
    I2C_CTRL_BYTE_RTCC_SRAM_RD =((RTCC_SRAM_ADDR_7BIT << 1) | 0x01),
    I2C_CTRL_BYTE_EEPROM       = (   EEPROM_ADDR_7BIT << 1),  /* RD or WR made in the Command Function Call */
    I2C_CTRL_BYTE_EEPROM_WR    = (   EEPROM_ADDR_7BIT << 1),
    I2C_CTRL_BYTE_EEPROM_RD    =((   EEPROM_ADDR_7BIT << 1) | 0x01),
    I2C_CTRL_BYTE_PICAUX       = (   PICAUX_ADDR_7BIT << 1),  /* RD or WR made in the Command Function Call */
    I2C_CTRL_BYTE_PICAUX_WR    = (   PICAUX_ADDR_7BIT << 1),
    I2C_CTRL_BYTE_PICAUX_RD    =((   PICAUX_ADDR_7BIT << 1) | 0x01),
    I2C_CTRL_BYTE_FLIR         = (     FLIR_ADDR_7BIT << 1),  /* RD or WR made in the Command Function Call */
    I2C_CTRL_BYTE_FLIR_WR      = (     FLIR_ADDR_7BIT << 1),
    I2C_CTRL_BYTE_FLIR_RD      =((     FLIR_ADDR_7BIT << 1) | 0x01),
            
    I2C_CTRL_BYTE_10BIT_SUPPORT=0xFFFF  /* to make 16-bit enumeration */
}eI2CCtrlByte_t;


typedef enum 
{
    /* Timekeeping */
    EXT_MEM_I2C_ADR_RTCSEC,
    EXT_MEM_I2C_ADR_RTCMIN,
    EXT_MEM_I2C_ADR_RTCHOUR,
    EXT_MEM_I2C_ADR_RTCWKDAY,
    EXT_MEM_I2C_ADR_RTCDATE,
    EXT_MEM_I2C_ADR_RTCMTH,
    EXT_MEM_I2C_ADR_RTCYEAR,
    EXT_MEM_I2C_ADR_CONTROL,
    EXT_MEM_I2C_ADR_OSCTRIM,
    EXT_MEM_I2C_ADR_EEUNLOCK,
  
    /* Alarm 0 */
    EXT_MEM_I2C_ADR_ALM0SEC,
    EXT_MEM_I2C_ADR_ALM0MIN,
    EXT_MEM_I2C_ADR_ALM0HOUR,
    EXT_MEM_I2C_ADR_ALM0WKDAY,
    EXT_MEM_I2C_ADR_ALM0DATE,
    EXT_MEM_I2C_ADR_ALM0MTH,
    EXT_MEM_I2C_ADR_ALM0RESERVED_DONT_USE,

    /* Alarm 1 */
    EXT_MEM_I2C_ADR_ALM1SEC,
    EXT_MEM_I2C_ADR_ALM1MIN,
    EXT_MEM_I2C_ADR_ALM1HOUR,
    EXT_MEM_I2C_ADR_ALM1WKDAY,
    EXT_MEM_I2C_ADR_ALM1DATE,
    EXT_MEM_I2C_ADR_ALM1MTH,
    EXT_MEM_I2C_ADR_ALM1RESERVED_DONT_USE,
            
    /* Power Down Time Stamp */
    EXT_MEM_I2C_ADR_PWRDNMIN,
    EXT_MEM_I2C_ADR_PWRDNHOUR,
    EXT_MEM_I2C_ADR_PWRDNDATE,
    EXT_MEM_I2C_ADR_PWRDNMTH,
            
    /* Power Up Time Stamp */
    EXT_MEM_I2C_ADR_PWRUPMIN,
    EXT_MEM_I2C_ADR_PWRUPHOUR,
    EXT_MEM_I2C_ADR_PWRUPDATE,
    EXT_MEM_I2C_ADR_PWRUPMTH,                   

}eI2CAddress_t;

typedef enum
{
    I2C_CMD_STA_IDLE                    = 0,        
    I2C_CMD_STA_START                   = 1,
    I2C_CMD_STA_START_WAIT              = 2,
    I2C_CMD_STA_SEND_CTRL               = 3,
    I2C_CMD_STA_SEND_ADDRESS_HI         = 4,
    I2C_CMD_STA_SEND_ADDRESS_LO         = 5,
    I2C_CMD_STA_SEND_DATA               = 6,
    I2C_CMD_STA_SEND_DATA_ACK           = 7,
            
    I2C_CMD_STA_READ_DATA_START         = 8,
    I2C_CMD_STA_READ_DATA_CONTROL       = 9,
    I2C_CMD_STA_READ_DATA_CONTROL_ACK   =10,
    I2C_CMD_STA_READ_DATA_RECEIVE       =11,
    I2C_CMD_STA_READ_DATA_RECEIVE_ACK   =12,
    I2C_CMD_STA_READ_DATA_RECEIVE_END   =13,        
            
    I2C_CMD_STA_STOP                    =14,
    I2C_CMD_STA_STOP_END                =15,
    I2C_CMD_STA_ERROR                   =16,        
    I2C_CMD_STA_ERROR_END               =17,
    I2C_CMD_STA_RETRY                   =18,
    I2C_CMD_STA_RETRY_END               =19,        
    I2C_CMD_STA_ACK_POOLING             =20,        
            
            
    I2C_CMD_STA_END                     =21,
            
    I2C_CMD_STA_COUNT
            
}eI2CCmdState_t;

typedef enum
{
    I2C_MESSAGE_FAIL,
    I2C_MESSAGE_PENDING,
    I2C_MESSAGE_COMPLETE,
    I2C_STUCK_START,
    I2C_MESSAGE_ADDRESS_NO_ACK,
    I2C_DATA_NO_ACK,
    I2C_LOST_STATE
} I2C_MESSAGE_STATUS;


/* *****************************************************************************
 * Type Definitions
 **************************************************************************** */  

typedef struct 
{
    volatile eI2CCmd_t eI2CCmd;
    eI2CCtrlByte_t eI2CCmdCtrlByte;
    uint16_t u16I2CCmdAddress;
    uint8_t* pI2CCmdBuffer;
    uint16_t u16I2CCmdSize;
    uint8_t u8I2CAddrSize;
    eI2CCmd_t eI2CCmdCommand;
    volatile eI2CCmdState_t eI2CCmdState;
    
}sI2CCommandData_t;

typedef struct 
{
    bool                jDone;
    eI2CCtrlByte_t      eI2CCmdCtrlByte;
    
    uint16_t u16I2CCmdAddress;
    HMDRV_ADDR_PNTR_MODIFIER uint8_t* pI2CCmdBuffer;
    uint16_t u16I2CCmdSize;
    uint8_t u8I2CAddrSize;
    eI2CCmd_t eI2CCmdCommand;
    volatile eI2CCmdState_t eI2CCmdState;
    uint16_t rtrycntr;
    uint16_t cntr;
    uint8_t u8UseAckPoolingWaitWriteComplete;       /* Use Ack Pool To Wait Write Complete - Default Off */
    
