devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP512GM710/i2cmem.c
}sI2CNonMCCData_t;



/* *****************************************************************************
 * Variables
 **************************************************************************** */  

#if USE_SPI_FLIR
eFlirI2CSta_t eFlirI2CSta = FLIR_I2C_STA_IDLE;
eFlirI2CCmd_t eFlirI2CCmd = FLIR_I2C_CMD_IDLE;
uint16_t u16FlirI2CCommand;
uint16_t u16FlirI2CSize;
uint8_t* pu8FlirI2CData;

uint8_t u8ReverseByteOrder0 = I2C_WRITE_REVERSE_ORDER_LSB_MSB;
uint8_t u8ReverseByteOrder1 = 0;
uint8_t u8ReverseByteOrder2 = 0;

uint16_t u16FlirI2CCommandReq;
uint16_t u16FlirI2CSizeReq;

uint8_t* pI2CFlirBufferRD = &FLIRData[0];//(uint8_t*)&RTCC;
uint8_t* pI2CFlirBufferWR = &FLIRData[0];//(uint8_t*)&RTCC;
uint8_t FLIRRegisters[4+1024];
uint8_t FLIRData[1024];
#endif

uint32_t u32Fi2c = Fi2c;
uint32_t u32Fi2cDelay = (uint32_t)((1000000000.0 / Fi2cDelay)+ 0.5); /* Frequency of 130 nsec delay in Hz */

#if 0   /* Could be Obsolete Code */
sI2CCommandData_t sI2CCommandDataI2C1 = 
{
    I2C_CMD_IDLE,
    0,
    0,
    NULL,
    0,
    0,
    I2C_CMD_IDLE,
    I2C_CMD_STA_IDLE,
    
};

sI2CCommandData_t sI2CCommandDataI2C2 = 
{
    I2C_CMD_IDLE,
    0,
    0,
    NULL,
    0,
    0,
    I2C_CMD_IDLE,
    I2C_CMD_STA_IDLE,
    
};

sI2CCommandData_t* psI2CCommandDataI2C1 = &sI2CCommandDataI2C1;
sI2CCommandData_t* psI2CCommandDataI2C2 = &sI2CCommandDataI2C2;
#endif

#ifndef BOARDCFG_USE_MCC_I2C
sI2CNonMCCData_t sI2CNonMCCData[I2C_COUNT] = 
{
    {
        .eI2CCmdState = I2C_CMD_STA_IDLE,
    },
    {
        .eI2CCmdState = I2C_CMD_STA_IDLE,
    },
};    
#endif

eI2CCmd_t eI2CCmd = I2C_CMD_IDLE;

sRTCC_t RTCC;
HMDRV_ADDR_PNTR_MODIFIER uint8_t SRAM_RTCC[64];
HMDRV_ADDR_PNTR_MODIFIER uint8_t EEPROM_RTCC[256];
HMDRV_ADDR_PNTR_MODIFIER uint8_t PICAUX[256];
eI2CCtrlByte_t eI2CCtrlByte = I2C_CTRL_BYTE_RTCC_SRAM_RD;
uint16_t u16I2CAddress = 0;
uint16_t u16I2CSizeRD = 8;
uint16_t u16I2CSizeWR = 8;


HMDRV_SIZE8 u8I2CModule = I2C_DEFAULT_MODULE;
HMDRV_ADDR_PNTR_MODIFIER uint8_t u8I2CBufferRD[I2C_COUNT][256];
HMDRV_ADDR_PNTR_MODIFIER uint8_t u8I2CBufferWR[I2C_COUNT][256];
HMDRV_ADDR_PNTR_MODIFIER uint8_t* pI2CBufferRD[I2C_COUNT] = {u8I2CBufferRD[I2C_1],u8I2CBufferRD[I2C_2]};
HMDRV_ADDR_PNTR_MODIFIER uint8_t* pI2CBufferWR[I2C_COUNT] = {u8I2CBufferWR[I2C_1],u8I2CBufferWR[I2C_2]};

uint8_t u8I2CBufferMCCUse[MCC_I2C_TRANSACTION_BLOCK_BUFFER_LENGTH];
uint8_t* pu8I2CBufferMCCUse = &u8I2CBufferMCCUse[0];

I2C_MESSAGE_STATUS u8DummyStatus;
I2C_MESSAGE_STATUS* pu8StatusTransaction = &u8DummyStatus;

/* *****************************************************************************
 * Function Prototypes
 **************************************************************************** */  


void I2CMEM_vProcessRWISR(void);
void I2CMEM_vProcessRWISR2(void);

#if USE_SPI_FLIR
void I2CMEM_vFlirProcessCmd(void);
#endif





/* *****************************************************************************
 * Function Definitions
 **************************************************************************** */  





/* *****************************************************************************
 * Functions For Application Usage
 **************************************************************************** */  


/* *****************************************************************************
 * I2CMEM_vCopyFromExtMem
 * 
 * Description: HMLIB Compatible copy function:
 * HMDRV_BPTR HMDRV_CopyToBuffer(HMDRV_BPTR pDestBuff, HMDRV_ADDR nSrcAddr, HMDRV_SIZE8 nSize)
 **************************************************************************** */
void I2CMEM_vCopyFromExtMem(HMDRV_BPTR pDestAddr, HMDRV_ADDR nSrcAddr, HMDRV_SIZE8 nSize)
{
    HMDRV_U16 addr = (HMDRV_U16)(HMDRV_ADDR_SIZE) nSrcAddr;
    HMDRV_U8* pd = (HMDRV_U8*)pDestAddr;
    HMDRV_SIZE8 addrSize = 1;
    HMDRV_ADDR_PNTR_MODIFIER HMDRV_U8* ps;
	eI2CCtrlByte_t eI2CCtrlByteRTCRead;
    HMDRV_SIZE8 I2CModule = u8I2CModule;
    #ifdef BOARDCFG_USE_MCC_I2C    
    //I2C_MESSAGE_STATUS u8StatusI2C;
    #endif
    
    /* FLIR */
    if (addr >= EXT_MEM_I2C_ADDR_OFFSET_FLIR)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_FLIR;
        eI2CCtrlByteRTCRead = I2C_CTRL_BYTE_FLIR;
        addrSize = 2;
    }
    /* PICAUX */
    else if (addr >= EXT_MEM_I2C_ADDR_OFFSET_PICAUX)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_PICAUX;
        eI2CCtrlByteRTCRead = I2C_CTRL_BYTE_PICAUX;
    }
    /* RTC EERPOM */
    else if (addr >= EXT_MEM_I2C_ADDR_OFFSET_RTC_EEPROM)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_RTC_EEPROM;
        eI2CCtrlByteRTCRead = I2C_CTRL_BYTE_EEPROM;
    }
    /* RTC SRAM */
    else
    {
        eI2CCtrlByteRTCRead = I2C_CTRL_BYTE_RTCC_SRAM;
    }

    ps = pI2CBufferRD[I2CModule];
    
    #ifndef BOARDCFG_USE_MCC_I2C    
    while(eI2CCmd == I2C_CMD_BUSY){;} /*  wait pending transfer */    
    I2CMEM_vRead(eI2CCtrlByteRTCRead, addr, ps , nSize, addrSize, I2CModule);
    while(eI2CCmd == I2C_CMD_BUSY){;} /*  wait pending transfer */
    #else
    I2CMEM_vRead(eI2CCtrlByteRTCRead, addr, ps , nSize, addrSize, I2CModule);
    //I2CMEM_vRead(eI2CCtrlByteRTCRead, addr, ps , nSize, addrSize, I2CModule, &u8StatusI2C);
    //while(u8StatusI2C == I2C_MESSAGE_PENDING){;} /*  wait pending transfer - if commented - made internally */
    #endif

    while(nSize--)
    {
        *pd++ = *ps++;
    }
    
}  

/* *****************************************************************************
 * I2CMEM_vCopyToExtMem
 * 
 * Description: HMLIB Compatible copy function:
 * HMDRV_BPTR HMDRV_CopyFromBuffer         (HMDRV_ADDR nDestAddr, HMDRV_BPTR pSrcBuff, HMDRV_SIZE8 nSize)
 **************************************************************************** */
void I2CMEM_vCopyToExtMem(HMDRV_ADDR nDestAddr, HMDRV_BPTR pSrcBuff, HMDRV_SIZE8 nSize)
{
    HMDRV_U8* ps = (HMDRV_U8*) pSrcBuff;
    HMDRV_U16 addr = (HMDRV_U16)(HMDRV_ADDR_SIZE) nDestAddr;
    HMDRV_ADDR_PNTR_MODIFIER HMDRV_U8* pb;
    HMDRV_SIZE8 size = nSize;
    eI2CCtrlByte_t eI2CCtrlByteRTC;
    HMDRV_SIZE8 addrSize = 1;
    HMDRV_SIZE8 I2CModule = u8I2CModule;
    #ifdef BOARDCFG_USE_MCC_I2C    
    //I2C_MESSAGE_STATUS u8StatusI2C;
    #endif
    
    
