devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP512GM710/i2cmem.c
    /* FLIR */
    if (addr >= EXT_MEM_I2C_ADDR_OFFSET_FLIR)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_FLIR;
        eI2CCtrlByteRTC = I2C_CTRL_BYTE_FLIR;
        addrSize = 2;
        #ifdef EXT_MEM_I2C_MODULE_FLIR
        I2CModule = EXT_MEM_I2C_MODULE_FLIR;
        #endif
    }
    /* PICAUX */
    else if (addr >= EXT_MEM_I2C_ADDR_OFFSET_PICAUX)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_PICAUX;
        eI2CCtrlByteRTC = I2C_CTRL_BYTE_PICAUX;
        #ifdef EXT_MEM_I2C_MODULE_PICAUX
        I2CModule = EXT_MEM_I2C_MODULE_PICAUX;
        #endif
    }
    /* RTC EERPOM */
    else if (addr >= EXT_MEM_I2C_ADDR_OFFSET_RTC_EEPROM)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_RTC_EEPROM;
        eI2CCtrlByteRTC = I2C_CTRL_BYTE_EEPROM;
        #ifdef EXT_MEM_I2C_MODULE_RTC
        I2CModule = EXT_MEM_I2C_MODULE_RTC;
        #endif
    }
    /* RTC SRAM */
    else
    {
        eI2CCtrlByteRTC = I2C_CTRL_BYTE_RTCC_SRAM;
        #ifdef EXT_MEM_I2C_MODULE_RTC
        I2CModule = EXT_MEM_I2C_MODULE_RTC;
        #endif
    }
    
    pb = pI2CBufferWR[I2CModule];

    while(nSize--)
        *pb++ = *ps++;
    
    #ifndef BOARDCFG_USE_MCC_I2C    
    while(eI2CCmd == I2C_CMD_BUSY){;} /*  wait pending transfer */
    I2CMEM_vWrite(eI2CCtrlByteRTC, addr, pb , size, addrSize, I2CModule);
    #else
    I2CMEM_vWrite(eI2CCtrlByteRTC, addr, pb , size, addrSize, I2CModule);
    //I2CMEM_vWrite(eI2CCtrlByteRTC, addr, pb , size, addrSize, I2CModule, &u8StatusI2C);
    #endif
}

/* *****************************************************************************
 * I2CMEM_vCopyToExtMemWithMask
 * 
 * Description: HMLIB Compatible copy function:
 * void HMDRV_CopyFromBufferWithMask(HMDRV_ADDR nDestAddr, HMDRV_BPTR pSrcBuff, HMDRV_SIZE8 nSize)
 **************************************************************************** */
void I2CMEM_vCopyToExtMemWithMask(HMDRV_ADDR nDestAddr, HMDRV_BPTR pSrcBuff, HMDRV_SIZE8 nSize)
{
    HMDRV_U8* ps = (HMDRV_U8*) pSrcBuff;
    HMDRV_U16 addr = (HMDRV_U16)(HMDRV_ADDR_SIZE) nDestAddr;
    HMDRV_U8* pm = ps + nSize;
    HMDRV_U8 mask, stmp, dtmp;
    HMDRV_ADDR_PNTR_MODIFIER HMDRV_U8* pbRD;
    HMDRV_ADDR_PNTR_MODIFIER HMDRV_U8* pbWR;
    HMDRV_SIZE8 size = nSize;
    eI2CCtrlByte_t eI2CCtrlByteRTCMask;
    HMDRV_SIZE8 addrSize = 1;
    HMDRV_SIZE8 I2CModule = u8I2CModule;
    #ifdef BOARDCFG_USE_MCC_I2C    
    //I2C_MESSAGE_STATUS u8StatusI2C;
    #endif

    
    /* FLIR */
    if (addr >= EXT_MEM_I2C_ADDR_OFFSET_FLIR)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_FLIR;
        eI2CCtrlByteRTCMask = I2C_CTRL_BYTE_FLIR;
        addrSize = 2;
        #ifdef EXT_MEM_I2C_MODULE_FLIR
        I2CModule = EXT_MEM_I2C_MODULE_FLIR;
        #endif
    }
    /* PICAUX */
    else if (addr >= EXT_MEM_I2C_ADDR_OFFSET_PICAUX)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_PICAUX;
        eI2CCtrlByteRTCMask = I2C_CTRL_BYTE_PICAUX;
        #ifdef EXT_MEM_I2C_MODULE_PICAUX
        I2CModule = EXT_MEM_I2C_MODULE_PICAUX;
        #endif
    }
    /* RTC EERPOM */
    else if (addr >= EXT_MEM_I2C_ADDR_OFFSET_RTC_EEPROM)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_RTC_EEPROM;
        eI2CCtrlByteRTCMask = I2C_CTRL_BYTE_EEPROM;
        #ifdef EXT_MEM_I2C_MODULE_RTC
        I2CModule = EXT_MEM_I2C_MODULE_RTC;
        #endif
    }
    /* RTC SRAM */
    else
    {
        eI2CCtrlByteRTCMask = I2C_CTRL_BYTE_RTCC_SRAM;
        #ifdef EXT_MEM_I2C_MODULE_RTC
        I2CModule = EXT_MEM_I2C_MODULE_RTC;
        #endif
    }
    
    pbRD = pI2CBufferRD[I2CModule];
    pbWR = pI2CBufferWR[I2CModule];
    
    #ifndef BOARDCFG_USE_MCC_I2C    
    while(eI2CCmd == I2C_CMD_BUSY){;} /*  wait pending transfer */
    I2CMEM_vRead(eI2CCtrlByteRTCMask, addr, pbRD , nSize, addrSize, I2CModule);
    while(eI2CCmd == I2C_CMD_BUSY){;} /*  wait pending transfer */
    #else
    I2CMEM_vRead(eI2CCtrlByteRTCMask, addr, pbRD , nSize, addrSize, I2CModule);
    //I2CMEM_vRead(eI2CCtrlByteRTCMask, addr, pbRD , nSize, addrSize, I2CModule, &u8StatusI2C);
    //while(u8StatusI2C == I2C_MESSAGE_PENDING){;} /*  wait pending transfer */
    #endif
    
    while(nSize--)
    {
        mask = *pm++;
        stmp = *ps++;
        dtmp = *pbRD++;

        /* perform AND-masking */
        stmp = (HMDRV_U8) ((stmp & mask) | (dtmp & ~mask));

        /* put the result in write buffer */
        *pbWR++ = stmp;
    }
    
    #ifndef BOARDCFG_USE_MCC_I2C    
    while(eI2CCmd == I2C_CMD_BUSY){;} /*  wait pending transfer */
    I2CMEM_vWrite(eI2CCtrlByteRTCMask, addr, pbWR , size, addrSize, I2CModule);
    #else
    I2CMEM_vWrite(eI2CCtrlByteRTCMask, addr, pbWR , size, addrSize, I2CModule);
    //I2CMEM_vWrite(eI2CCtrlByteRTCMask, addr, pbWR , size, addrSize, I2CModule, &u8StatusI2C);
    #endif
}


/* *****************************************************************************
 * I2CMEM_pExtMemRamToIntRam
 * 
 * Description: Copy Data from external memory to internal RAM and 
 *              returns pointer to internal RAM
 **************************************************************************** */
//HMDRV_ADDR_PNTR_MODIFIER HMDRV_BPTR I2CMEM_pExtMemRamToIntRam(HMDRV_ADDR nSrcAddr, HMDRV_SIZE8 nSize)
HMDRV_ADDR I2CMEM_pExtMemRamToIntRam(HMDRV_ADDR nSrcAddr, HMDRV_SIZE8 nSize)
{
    HMDRV_U16 addr = (HMDRV_U16)(HMDRV_ADDR_SIZE) nSrcAddr;
    HMDRV_ADDR_PNTR_MODIFIER HMDRV_U8* ps;
	eI2CCtrlByte_t eI2CCtrlByteRTCRead;
    HMDRV_SIZE8 addrSize = 1;
    HMDRV_SIZE8 I2CModule = u8I2CModule;
    #ifdef BOARDCFG_USE_MCC_I2C    
    //I2C_MESSAGE_STATUS u8StatusI2C;
    #endif
    
    /* FLIR */
    if (addr >= EXT_MEM_I2C_ADDR_OFFSET_FLIR)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_FLIR;
        eI2CCtrlByteRTCRead = I2C_CTRL_BYTE_FLIR;
        addrSize = 2;
        #ifdef EXT_MEM_I2C_MODULE_FLIR
        I2CModule = EXT_MEM_I2C_MODULE_FLIR;
        #endif
    }
    /* PICAUX */
    else if (addr >= EXT_MEM_I2C_ADDR_OFFSET_PICAUX)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_PICAUX;
        eI2CCtrlByteRTCRead = I2C_CTRL_BYTE_PICAUX;
        #ifdef EXT_MEM_I2C_MODULE_PICAUX
        I2CModule = EXT_MEM_I2C_MODULE_PICAUX;
        #endif
    }
    /* RTC EERPOM */
    else if (addr >= EXT_MEM_I2C_ADDR_OFFSET_RTC_EEPROM)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_RTC_EEPROM;
        eI2CCtrlByteRTCRead = I2C_CTRL_BYTE_EEPROM;
        #ifdef EXT_MEM_I2C_MODULE_RTC
        I2CModule = EXT_MEM_I2C_MODULE_RTC;
        #endif
    }
    /* RTC SRAM */
    else
    {
        eI2CCtrlByteRTCRead = I2C_CTRL_BYTE_RTCC_SRAM;
        #ifdef EXT_MEM_I2C_MODULE_RTC
        I2CModule = EXT_MEM_I2C_MODULE_RTC;
        #endif
    }
    ps = pI2CBufferRD[I2CModule];

