devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP512GM710/i2cmem.c
    #ifndef BOARDCFG_USE_MCC_I2C    
    while(eI2CCmd == I2C_CMD_BUSY){;} /*  wait pending transfer */    
    I2CMEM_vRead(eI2CCtrlByteRTCRead, addr, ps , nSize, addrSize, I2CModule);
    while(eI2CCmd == I2C_CMD_BUSY){;} /*  wait pending transfer */
    #else
    I2CMEM_vRead(eI2CCtrlByteRTCRead, addr, ps , nSize, addrSize, I2CModule);
    //I2CMEM_vRead(eI2CCtrlByteRTCRead, addr, ps , nSize, addrSize, I2CModule, &u8StatusI2C);
    //while(u8StatusI2C == I2C_MESSAGE_PENDING){;} /*  wait pending transfer */
    #endif
    
    
    return (HMDRV_ADDR)ps;
}

/* *****************************************************************************
 * I2CMEM_pExtMemRamFromIntRam
 * 
 * Description: returns pointer to internal RAM for 
 *              Copy Data to external memory from internal RAM 
 *              
 **************************************************************************** */
HMDRV_ADDR I2CMEM_pExtMemRamFromIntRam(HMDRV_ADDR nDestAddr)
{
    HMDRV_SIZE8 I2CModule = u8I2CModule;
    HMDRV_ADDR_PNTR_MODIFIER HMDRV_U8* pb;
    
    /* FLIR */
    if (nDestAddr >= EXT_MEM_I2C_ADDR_OFFSET_FLIR)  
    {
        #ifdef EXT_MEM_I2C_MODULE_FLIR
        I2CModule = EXT_MEM_I2C_MODULE_FLIR;
        #endif
    }
    /* PICAUX */
    else if (nDestAddr >= EXT_MEM_I2C_ADDR_OFFSET_PICAUX)  
    {
        #ifdef EXT_MEM_I2C_MODULE_PICAUX
        I2CModule = EXT_MEM_I2C_MODULE_PICAUX;
        #endif
    }
    /* RTC EERPOM */
    else if (nDestAddr >= EXT_MEM_I2C_ADDR_OFFSET_RTC_EEPROM)  
    {
        #ifdef EXT_MEM_I2C_MODULE_RTC
        I2CModule = EXT_MEM_I2C_MODULE_RTC;
        #endif
    }
    /* RTC SRAM */
    else
    {
        #ifdef EXT_MEM_I2C_MODULE_RTC
        I2CModule = EXT_MEM_I2C_MODULE_RTC;
        #endif
    }
    pb = pI2CBufferWR[I2CModule];
    
    return (HMDRV_ADDR)pb;
}





/* *****************************************************************************
 * I2CMEM_vProcessCmd
 * 
 * Description: For Testing Usage In main Loop
 *              
 **************************************************************************** */
void I2CMEM_vProcessCmd(void)
{

    
    switch (eI2CCmd)
    {
        case I2C_CMD_WR:   
            
            I2CMEM_vWrite(eI2CCtrlByte, u16I2CAddress, pI2CBufferWR[u8I2CModule], u16I2CSizeWR, 1, u8I2CModule);
            break;
            
        case I2C_CMD_RD:       
            I2CMEM_vRead(eI2CCtrlByte, u16I2CAddress, pI2CBufferRD[u8I2CModule], u16I2CSizeRD, 1, u8I2CModule);
            break;
            
        case I2C_CMD_RTCC_WR:
            I2CMEM_vWrite(I2C_CTRL_BYTE_RTCC_SRAM_WR, u16I2CAddress, (HMDRV_ADDR_PNTR_MODIFIER uint8_t*)&RTCC + u16I2CAddress, u16I2CSizeWR, 1, u8I2CModule);
            break;
            
        case I2C_CMD_RTCC_RD:
            I2CMEM_vRead(I2C_CTRL_BYTE_RTCC_SRAM_RD, u16I2CAddress, (HMDRV_ADDR_PNTR_MODIFIER uint8_t*)&RTCC + u16I2CAddress, u16I2CSizeRD, 1, u8I2CModule);
            break;
            
        case I2C_CMD_SRAM_WR:
            I2CMEM_vWrite(I2C_CTRL_BYTE_RTCC_SRAM_WR, u16I2CAddress + EXT_MEM_RTCC_SRAM_ADDRESS_OFFSET, (HMDRV_ADDR_PNTR_MODIFIER uint8_t*)&SRAM_RTCC + u16I2CAddress, u16I2CSizeWR, 1, u8I2CModule);
            break;
            
        case I2C_CMD_SRAM_RD:
            I2CMEM_vRead(I2C_CTRL_BYTE_RTCC_SRAM_RD, u16I2CAddress + EXT_MEM_RTCC_SRAM_ADDRESS_OFFSET, (HMDRV_ADDR_PNTR_MODIFIER uint8_t*)&SRAM_RTCC + u16I2CAddress, u16I2CSizeRD, 1, u8I2CModule);
            break;
            
        case I2C_CMD_EEPROM_WR:
            I2CMEM_vWrite(I2C_CTRL_BYTE_EEPROM_WR, u16I2CAddress, (HMDRV_ADDR_PNTR_MODIFIER uint8_t*)&EEPROM_RTCC + u16I2CAddress, u16I2CSizeWR, 1, u8I2CModule);
            break;
            
        case I2C_CMD_EEPROM_RD:
            I2CMEM_vRead(I2C_CTRL_BYTE_EEPROM_RD, u16I2CAddress, (HMDRV_ADDR_PNTR_MODIFIER uint8_t*)&EEPROM_RTCC + u16I2CAddress, u16I2CSizeRD, 1, u8I2CModule);
            break;
            
        case I2C_CMD_PICAUX_WR:
            I2CMEM_vWrite(I2C_CTRL_BYTE_PICAUX_WR, u16I2CAddress, (HMDRV_ADDR_PNTR_MODIFIER uint8_t*)&PICAUX + u16I2CAddress, u16I2CSizeWR, 1, u8I2CModule);
            break;
            
        case I2C_CMD_PICAUX_RD:
            I2CMEM_vRead(I2C_CTRL_BYTE_PICAUX_RD, u16I2CAddress, (HMDRV_ADDR_PNTR_MODIFIER uint8_t*)&PICAUX + u16I2CAddress, u16I2CSizeRD, 1, u8I2CModule);
            break;

        #if USE_SPI_FLIR
        #ifndef BOARDCFG_USE_MCC_I2C   /* check if rework need for MCC */  
        case I2C_CMD_FLIR_WR:
            I2CMEM_vWrite(I2C_CTRL_BYTE_FLIR_WR, u16I2CAddress, (uint8_t*)&FLIRRegisters + u16I2CAddress, u16I2CSizeWR, 2, u8I2CModule);
            break;
            
        case I2C_CMD_FLIR_RD:
            I2CMEM_vRead(I2C_CTRL_BYTE_FLIR_RD, u16I2CAddress, (uint8_t*)&FLIRRegisters + u16I2CAddress, u16I2CSizeRD, 2, u8I2CModule);
            break;
          
        case I2C_CMD_FLIR_CCI_TWI_WR:
            eI2CCmd = I2C_CMD_BUSY;  
            I2CMEM_vFlirWrite(u16FlirI2CCommandReq, (uint8_t*)&FLIRData, u16FlirI2CSizeReq, u8I2CModule);
            break;
            
        case I2C_CMD_FLIR_CCI_TWI_RD:
            eI2CCmd = I2C_CMD_BUSY;  
            I2CMEM_vFlirRead(u16FlirI2CCommandReq, (uint8_t*)&FLIRData, u16FlirI2CSizeReq, u8I2CModule);
            break;
        case I2C_CMD_FLIR_CCI_TWI_RUN:
            eI2CCmd = I2C_CMD_BUSY;  
            I2CMEM_vFlirRun(u16FlirI2CCommandReq, u8I2CModule);
            break;
        #endif
        #endif  
            
        default:
            
            break;
    }

    #ifdef BOARDCFG_USE_MCC_I2C   
    eI2CCmd = I2C_CMD_IDLE;  
    #endif
}

/* *****************************************************************************
 * I2CMEM_vExtMemRamFromIntRamCopyData
 * 
 * Description: Copy Data to external memory from already filled internal RAM buffer
 **************************************************************************** */
void I2CMEM_vExtMemRamFromIntRamCopyData(HMDRV_ADDR nDestAddr, HMDRV_SIZE8 nSize)
{
    HMDRV_U16 addr = (HMDRV_U16)(HMDRV_ADDR_SIZE) nDestAddr;
    HMDRV_SIZE8 size = nSize;
    HMDRV_SIZE8 addrSize = 1;
    eI2CCtrlByte_t eI2CCtrlByteRTC;
    HMDRV_SIZE8 I2CModule = u8I2CModule;
    #ifdef BOARDCFG_USE_MCC_I2C    
    //I2C_MESSAGE_STATUS u8StatusI2C;
    #endif
    
    
