devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP512GM710/i2cmem.c
    /* FLIR */
    if (addr >= EXT_MEM_I2C_ADDR_OFFSET_FLIR)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_FLIR;
        eI2CCtrlByteRTC = I2C_CTRL_BYTE_FLIR;
        addrSize = 2;
        #ifdef EXT_MEM_I2C_MODULE_FLIR
        I2CModule = EXT_MEM_I2C_MODULE_FLIR;
        #endif
    }
    /* PICAUX */
    else if (addr >= EXT_MEM_I2C_ADDR_OFFSET_PICAUX)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_PICAUX;
        eI2CCtrlByteRTC = I2C_CTRL_BYTE_PICAUX;
        #ifdef EXT_MEM_I2C_MODULE_PICAUX
        I2CModule = EXT_MEM_I2C_MODULE_PICAUX;
        #endif
    }
    /* RTC EERPOM */
    else if (addr >= EXT_MEM_I2C_ADDR_OFFSET_RTC_EEPROM)  
    {
        addr -= EXT_MEM_I2C_ADDR_OFFSET_RTC_EEPROM;
        eI2CCtrlByteRTC = I2C_CTRL_BYTE_EEPROM;
        #ifdef EXT_MEM_I2C_MODULE_RTC
        I2CModule = EXT_MEM_I2C_MODULE_RTC;
        #endif
    }
    /* RTC SRAM */
    else
    {
        eI2CCtrlByteRTC = I2C_CTRL_BYTE_RTCC_SRAM;
        #ifdef EXT_MEM_I2C_MODULE_RTC
        I2CModule = EXT_MEM_I2C_MODULE_RTC;
        #endif
    }

    //while(nSize--)
    //    *pb++ = *ps++;
    
    #ifndef BOARDCFG_USE_MCC_I2C    
    while(eI2CCmd == I2C_CMD_BUSY){;} /*  wait pending transfer */
    I2CMEM_vWrite(eI2CCtrlByteRTC, addr, pI2CBufferWR[I2CModule] , size, addrSize, I2CModule);
    #else
    I2CMEM_vWrite(eI2CCtrlByteRTC, addr, pI2CBufferWR[I2CModule] , size, addrSize, I2CModule);
    //I2CMEM_vWrite(eI2CCtrlByteRTC, addr, pI2CBufferWR[I2CModule] , size, addrSize, I2CModule, &u8StatusI2C);
    #endif
}


#ifndef BOARDCFG_USE_MCC_I2C    

eI2CCmd_t I2CMEM_bGetCmd(eI2CCmd_t eI2CCmdInput)
{
    
    eI2CCmd_t state = I2C_CMD_BUSY;
    state = eI2CCmdInput;
    return state;
}

bool I2CMEM_bGetCmdStateIdle(void)
{
    bool result = false;
    if (eI2CCmd == I2C_CMD_IDLE)
    {
        result = true;
    }
    return result;
}

bool I2CMEM_bGetCmdStateModuleIdle(I2C_eModule_t eModule)
{
    bool result = false;
    if (sI2CNonMCCData[eModule].eI2CCmdState == I2C_CMD_STA_IDLE)
    {
        result = true;
    }
    return result;
}

#endif

bool I2CMEM_bGetMemStateIdle(void)
{
    bool result = false;
    if (eI2CCmd == I2C_CMD_IDLE)
    {
        result = true;
    }
    return result;
}


/* *****************************************************************************
 * The Mid Level Read-Write Functions - everything goes trough here
 **************************************************************************** */



/* *****************************************************************************
 * I2CMEM_vWrite
 * 
 * Inputs:
 *  uint16_t u16Address - make this 32 bits to support more than 2 bytes address with MCC
 * 
 * Description: Write To I2C
 *              
 **************************************************************************** */

#ifndef BOARDCFG_USE_MCC_I2C    
void I2CMEM_vWrite(uint16_t u16AddressI2C, uint16_t u16Address, HMDRV_ADDR_PNTR_MODIFIER uint8_t* pdData, uint16_t u16Size, uint8_t u8AddressSize, uint8_t u8I2CModule)
{
    sI2CNonMCCData_t* psI2CData = (sI2CNonMCCData_t*)&sI2CNonMCCData[u8I2CModule];
    
    if (psI2CData->eI2CCmdState == I2C_CMD_STA_IDLE)
    {
        eI2CCmd = I2C_CMD_BUSY;  /* consider to be reworked in new version */
        
        psI2CData->eI2CCmdCtrlByte = u16AddressI2C & (~(0x0001));   /* write command */
        psI2CData->u16I2CCmdAddress = u16Address;
        psI2CData->pI2CCmdBuffer = pdData;
        psI2CData->u16I2CCmdSize = u16Size;
        psI2CData->u8I2CAddrSize = u8AddressSize;
        psI2CData->eI2CCmdCommand = I2C_CMD_WR;
        
        psI2CData->rtrycntr = 0;
        psI2CData->cntr = 0;
        
        if (u8I2CModule == 0)
        {
            #if USE_I2C_ISR == 1
            // Start Condition
            psI2CData->eI2CCmdState = I2C_CMD_STA_START_WAIT;
            I2C1CONbits.SEN = 1;
            #else
            psI2CData->eI2CCmdState = I2C_CMD_STA_START;
            #endif
        }
        else
        {
            #if USE_I2C_ISR == 1
            // Start Condition
            psI2CData->eI2CCmdState = I2C_CMD_STA_START_WAIT;
            I2C2CONbits.SEN = 1;
            #else
            psI2CData->eI2CCmdState = I2C_CMD_STA_START;
            #endif
        }
        
    }

}
#else
void I2CMEM_vWrite(uint16_t u16AddressI2C, uint16_t u16Address, HMDRV_ADDR_PNTR_MODIFIER uint8_t* pdData, uint16_t u16Size, uint8_t u8AddressSize, uint8_t u8I2CModule)
{
    
    uint8_t index;
    
    index = 0;

    while (u8AddressSize > 0)
    {
        u8AddressSize--;
        pu8I2CBufferMCCUse[index++] = u16Address;
        u16Address >>= 8;
    }
    while (u16Size > 0)
    {
        u16Size--;
        pu8I2CBufferMCCUse[index++] = *pdData++;
    }
    if (u8I2CModule == 0)
    {
        while (I2C1_MasterQueueIsFull()){;}
        I2C1_MasterWrite(pu8I2CBufferMCCUse, index, 
                (u16AddressI2C >> 1), (I2C1_MESSAGE_STATUS*)pu8StatusTransaction); 
    }
    else
    {
        while (I2C2_MasterQueueIsFull()){;}
        I2C2_MasterWrite(pu8I2CBufferMCCUse, index, 
                (u16AddressI2C >> 1), (I2C2_MESSAGE_STATUS*)pu8StatusTransaction); 
    }

    
}
#endif



/* *****************************************************************************
 * I2CMEM_vRead
 * 
 * Description: Read From I2C
 *              
 **************************************************************************** */
#ifndef BOARDCFG_USE_MCC_I2C    
void I2CMEM_vRead(uint16_t u16AddressI2C, uint16_t u16Address, HMDRV_ADDR_PNTR_MODIFIER uint8_t* pdData, uint16_t u16Size, uint8_t u8AddressSize, uint8_t u8I2CModule)
{
    sI2CNonMCCData_t* psI2CData = (sI2CNonMCCData_t*)&sI2CNonMCCData[u8I2CModule];
    
    if (psI2CData->eI2CCmdState == I2C_CMD_STA_IDLE)
    {
        eI2CCmd = I2C_CMD_BUSY;  /* consider to be reworked in new version */
        psI2CData->eI2CCmdCtrlByte = u16AddressI2C | (0x0001);
        psI2CData->u16I2CCmdAddress = u16Address;
        psI2CData->pI2CCmdBuffer = pdData;
        psI2CData->u16I2CCmdSize = u16Size;
        psI2CData->u8I2CAddrSize = u8AddressSize;
        psI2CData->eI2CCmdCommand = I2C_CMD_RD;

        
        psI2CData->rtrycntr = 0;
        psI2CData->cntr = 0;
        
        
        if (u8I2CModule == 0)
        {
            #if USE_I2C_ISR == 1
            // Start Condition
            psI2CData->eI2CCmdState = I2C_CMD_STA_START_WAIT;
            I2C1CONbits.SEN = 1;
            #else
            psI2CData->eI2CCmdState = I2C_CMD_STA_START;
            #endif
        }
        else
        {
            #if USE_I2C_ISR == 1
            // Start Condition
            psI2CData->eI2CCmdState = I2C_CMD_STA_START_WAIT;
            I2C2CONbits.SEN = 1;
            #else
            psI2CData->eI2CCmdState = I2C_CMD_STA_START;
            #endif
        }
        
