devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP512GM710/i2cmem.c
    }

    
}
#else



void vCopyFromI2CBuffer(uint16_t u16Size, HMDRV_ADDR_PNTR_MODIFIER uint8_t* pdData)
{
    uint16_t u16Index;
    for (u16Index = 0; u16Index < u16Size; u16Index++)
    {
        *pdData++ = pu8I2CBufferMCCUse[u16Index];
    }
}


void I2CMEM_vRead(uint16_t u16AddressI2C, uint16_t u16Address, HMDRV_ADDR_PNTR_MODIFIER uint8_t* pdData, uint16_t u16Size, uint8_t u8AddressSize, uint8_t u8I2CModule)
{
    uint16_t index;
    uint16_t size = u16Size;
    
    
    index = 0;

    while (u8AddressSize > 0)
    {
        u8AddressSize--;
        pu8I2CBufferMCCUse[index++] = u16Address;
        u16Address >>= 8;
    }
    if (u8I2CModule == 0)
    {
        do
        {
            Nop();
        }
        while (I2C1_MasterQueueIsFull());
        I2C1_MasterWrite(pu8I2CBufferMCCUse, index, (u16AddressI2C >> 1), (I2C1_MESSAGE_STATUS*)pu8StatusTransaction); 
        do
        {
            Nop();
        }
        while (I2C1_MasterQueueIsFull());
        I2C1_MasterRead(pu8I2CBufferMCCUse, size, (u16AddressI2C >> 1), (I2C1_MESSAGE_STATUS*)pu8StatusTransaction); /* Select line above if the whole function returns the status instead of this line and the line below */ 
    }
    else
    {
        do
        {
            Nop();
        }
        while (I2C2_MasterQueueIsFull());
        I2C2_MasterWrite(pu8I2CBufferMCCUse, index, (u16AddressI2C >> 1), (I2C2_MESSAGE_STATUS*)pu8StatusTransaction); 
        do
        {
            Nop();
        }
        while (I2C2_MasterQueueIsFull());
        I2C2_MasterRead(pu8I2CBufferMCCUse, size, (u16AddressI2C >> 1), (I2C2_MESSAGE_STATUS*)pu8StatusTransaction); /* Select line above if the whole function returns the status instead of this line and the line below */
    }
    
    do
    {
        Nop();
    }
    while (*pu8StatusTransaction == I2C_MESSAGE_PENDING);
    vCopyFromI2CBuffer(size, pdData);  
    
} 




#endif





#ifndef BOARDCFG_USE_MCC_I2C

/******************************************************************************
 * Function:        void I2CEMEMinit(I2CEMEM_DRV *i2cMem)
 *
 * PreCondition:    None
 *
 * Input:           *i2cMem
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        I2C initialization/configuration function.
 *                  This function is used to configure the I2C module as the
 *                  master and use 8-bit mode for communication
 *                  with the serial EEPROM.
 *****************************************************************************/
void I2CMEM_vInit(uint32_t u32Fcy)
{
#if  USE_I2C1
    // Configre SCA/SDA pin as open-drain. This may change from device to device.
    //Refer the datasheet for more information.
    I2C1_SDA_SetOpenDrain();
    I2C1_SCL_SetOpenDrain();

    I2C1CONbits.A10M = 0;
    I2C1CONbits.SCLREL = 1;
    I2C1BRG = (u32Fcy / u32Fi2c - u32Fcy / u32Fi2cDelay) - 2;  /* (1/Fi2c - Delay)*Fcy - 2 */

    I2C1ADD = 0;
    I2C1MSK = 0;

    I2C1CONbits.I2CEN = 1;
    IEC1bits.MI2C1IE = 1;
    IPC4bits.MI2C1IP = ISR_PRIORITY_I2C1;
    IFS1bits.MI2C1IF = 0;
#endif
    
#if  USE_I2C2
    // Configre SCA/SDA pin as open-drain. This may change from device to device.
    //Refer the datasheet for more information.
    I2C2_SCL_SetOpenDrain();
    I2C2_SDA_SetOpenDrain();

    I2C2CONbits.A10M = 0;
    I2C2CONbits.SCLREL = 1;
    I2C2BRG = (u32Fcy / u32Fi2c - u32Fcy / u32Fi2cDelay) - 2;  /* (1/Fi2c - Delay)*Fcy - 2 */

    I2C2ADD = 0;
    I2C2MSK = 0;

    I2C2CONbits.I2CEN = 1;
    IEC3bits.MI2C2IE = 1;
    IPC12bits.MI2C2IP = ISR_PRIORITY_I2C2;
    IFS3bits.MI2C2IF = 0;
#endif
}


/******************************************************************************
 * I2C Driver Related Functions
 *****************************************************************************/




/******************************************************************************
 * Function:  void __attribute__((interrupt, auto_psv)) _MI2C1Interrupt(void)
 * 
 * Overview:        This serves the I2C Master Interrupt Service Routine.
 *****************************************************************************/
void __attribute__ ( (interrupt, auto_psv) ) _MI2C1Interrupt( void )
{
    IFS1bits.MI2C1IF = 0;   //Clear the Interrupt Flag;
    sI2CNonMCCData[I2C_1].jDone = 1;
    I2CMEM_vProcessRWISR(); /* Inside eI2CCmdState = I2C_CMD_STA_IDLE on Transfer Complete */
    
#if USE_SPI_FLIR
    /* Process Flir Protocol */
    if (eI2CCmdState == I2C_CMD_STA_IDLE)
    {
        I2CMEM_vFlirProcessCmd();
    }
#endif        
}

#if 0       /* Slave I2C Not Used */
/******************************************************************************
 * Function:  void __attribute__((interrupt, auto_psv)) _SI2C1Interrupt(void)
 *
 * Overview:        This serves the I2C Slave interrupt.
 *****************************************************************************/
void __attribute__ ( (interrupt, auto_psv) ) _SI2C1Interrupt( void )
{
    IFS1bits.SI2C1IF = 0;   //Clear the Interrupt Flag
}
#endif


/******************************************************************************
 * Function:  void __attribute__((interrupt, auto_psv)) _MI2C2Interrupt(void)
 *
 * Overview:        This serves the I2C Master Interrupt Service Routine.
 *****************************************************************************/
void __attribute__ ( (interrupt, auto_psv) ) _MI2C2Interrupt( void )
{
    IFS3bits.MI2C2IF = 0;   //Clear the Interrupt Flag;
    sI2CNonMCCData[I2C_2].jDone = 1;
    I2CMEM_vProcessRWISR2();
    
#if USE_SPI_FLIR
    /* Process Flir Protocol */
    if (eI2CCmdState == I2C_CMD_STA_IDLE)
    {
        I2CMEM_vFlirProcessCmd();
    }
#endif
}

#if 0       /* Slave I2C Not Used */
/******************************************************************************
 * Function:  void __attribute__((interrupt, auto_psv)) _SI2C2Interrupt(void)
 *
 * Overview:        This serves the I2C Slave interrupt.
 *****************************************************************************/
void __attribute__ ( (interrupt, auto_psv) ) _SI2C2Interrupt( void )
{
    IFS3bits.SI2C2IF = 0;   //Clear the Interrupt Flag
}
#endif











            




#if USE_I2C_ISR /* ISR or Non-ISR I2C Process Loop Driver Functions */
/******************************************************************************
 * I2C ISR Related Functions
 *****************************************************************************/


void I2CMEM_vProcessRW(void)
{
    /* Dummy Function - Pooling not made in main loop - used ISR */
}

