devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP512GM710/i2cmem.c
void I2CMEM_vProcessRWISR2(void)
{    
    sI2CNonMCCData_t* psI2CData = (sI2CNonMCCData_t*)&sI2CNonMCCData[I2C_2];
    
    switch (psI2CData->eI2CCmdState)
    {
        /*==================================*/
        /* Control/Address Phase            */
        /*==================================*/
        
//        case I2C_CMD_STA_START:
//            // Start Condition
//            I2C2CONbits.SEN = 1;
//            eI2CCmdState = I2C_CMD_STA_START_WAIT;
//            break;
        case I2C_CMD_STA_START_WAIT:
            // Start (Control) Byte with device select id
            if( psI2CData->jDone == 1 )
            {
                psI2CData->jDone = 0;
                //    I2C2TRN=(0x00A0)|(((i2cMem->oData->csel)&0x7)<<1);
                I2C2TRN = psI2CData->eI2CCmdCtrlByte & (~(0x0001));    /* Always Write command for Address */
                psI2CData->eI2CCmdState = I2C_CMD_STA_SEND_CTRL;
            }
            break;
       case I2C_CMD_STA_SEND_CTRL:
            // Send address byte 1, if ack is received. Else Retry
            if( psI2CData->jDone == 1 )
            {
                psI2CData->jDone = 0;

                if( I2C2STATbits.ACKSTAT == 1 )
                {                   // Ack Not received, Retry
                    if( psI2CData->rtrycntr < I2C_MAX_RETRY )
                    {
                        //eI2CCmdState = I2C_CMD_STA_RETRY;
                        I2C2CONbits.PEN = 1;
                        psI2CData->eI2CCmdState = I2C_CMD_STA_RETRY_END;
                        psI2CData->rtrycntr++;
                    }
                    else
                    {
                        //eI2CCmdState = I2C_CMD_STA_ERROR; // Flag error and exit
                        I2C2CONbits.PEN = 1;
                        psI2CData->eI2CCmdState = I2C_CMD_STA_ERROR_END;
                    }
                }
                else
                {
                    psI2CData->rtrycntr = 0;
                    if (psI2CData->u8I2CAddrSize == 2)
                    {
                    //#if I2C_ADDRWIDTH == TWO_BYTE
                        I2C2TRN = (psI2CData->u16I2CCmdAddress)  >> 8;
                        psI2CData->eI2CCmdState = I2C_CMD_STA_SEND_ADDRESS_HI;
                    //#endif
                    }
                    else /* if (u8I2CAddrSize == 1) */
                    {
                    //#if I2C_ADDRWIDTH == ONE_BYTE
                        I2C2TRN = (psI2CData->u16I2CCmdAddress);
                        psI2CData->eI2CCmdState = I2C_CMD_STA_SEND_ADDRESS_LO;
                    //#endif
                    }
                }
            }
            break;
            
         case I2C_CMD_STA_SEND_ADDRESS_HI:
            // Send address byte 2, if ack is received. Else Flag error and exit
            if( psI2CData->jDone == 1 )
            {
                psI2CData->jDone = 0;

                if( I2C2STATbits.ACKSTAT == 1 )
                {                   // Ack Not received, Flag error and exit
                    //eI2CCmdState = I2C_CMD_STA_ERROR;
                    I2C2CONbits.PEN = 1;
                    psI2CData->eI2CCmdState = I2C_CMD_STA_ERROR_END;
                }
                else
                {
                    if (psI2CData->u8I2CAddrSize == 2)
                    {
                    //#if I2C_ADDRWIDTH == TWO_BYTE
                        I2C2TRN = ( (psI2CData->u16I2CCmdAddress) & 0x00FF );
                    //#endif
                    }
                    psI2CData->eI2CCmdState = I2C_CMD_STA_SEND_ADDRESS_LO;
                }
            }

            break;

        case I2C_CMD_STA_SEND_ADDRESS_LO:
            // Read or Write
            if( psI2CData->jDone == 1 )
            {
                psI2CData->jDone = 0;

                if( I2C2STATbits.ACKSTAT == 1 )
                {                   // Ack Not received, Flag error and exit
                    //eI2CCmdState = I2C_CMD_STA_ERROR;
                    I2C2CONbits.PEN = 1;
                    psI2CData->eI2CCmdState = I2C_CMD_STA_ERROR_END;
                }
                else
                {
                    if( psI2CData->eI2CCmdCommand == I2C_CMD_WR )
                    {
                        //eI2CCmdState = I2C_CMD_STA_SEND_DATA;
                        
                        if (psI2CData->u8I2CAddrSize == 2) /* 16-bit data MSB First */
                        {
                            if ((psI2CData->cntr & 1) == 0)
                            {
                                I2C2TRN = *( psI2CData->pI2CCmdBuffer + psI2CData->cntr + 1 );
                            }
                            else
                            {
                                I2C2TRN = *( psI2CData->pI2CCmdBuffer + psI2CData->cntr - 1 );
                            }
                        } 
                        else /* if (u8I2CAddrSize == 1) */
                        {
                            I2C2TRN = *( psI2CData->pI2CCmdBuffer + psI2CData->cntr );
                        }
                        
                        psI2CData->eI2CCmdState = I2C_CMD_STA_SEND_DATA_ACK;
                        psI2CData->cntr = psI2CData->cntr + 1;
                    }

                    if( psI2CData->eI2CCmdCommand == I2C_CMD_RD )
                    {
                        //eI2CCmdState = I2C_CMD_STA_READ_DATA_START;
                        // Repeat Start
                        I2C2CONbits.RSEN = 1;
                        psI2CData->eI2CCmdState = I2C_CMD_STA_READ_DATA_CONTROL;
                    }
                }
            }

            break;

        /*==================================*/
        /* Write Data Phase                    */
        /*==================================*/
//        case I2C_CMD_STA_SEND_DATA:
//            // Send data
//            I2C2TRN = *( pI2CCmdBuffer + cntr );
//            eI2CCmdState = I2C_CMD_STA_SEND_DATA_ACK;
//            cntr = cntr + 1;
//            break;

        case I2C_CMD_STA_SEND_DATA_ACK:
            // Look for end of data or no Ack
            if( psI2CData->jDone == 1 )
            {
                psI2CData->jDone = 0;
                

                if( I2C2STATbits.ACKSTAT == 1 )
                {                   // Ack Not received, Flag error and exit
                    //eI2CCmdState = I2C_CMD_STA_ERROR;
                    I2C2CONbits.PEN = 1;
                    psI2CData->eI2CCmdState = I2C_CMD_STA_ERROR_END;
                }
                else
                {
                    if( psI2CData->cntr == psI2CData->u16I2CCmdSize )
                    {  
                        if (psI2CData->u8UseAckPoolingWaitWriteComplete)
                        {
                            //eI2CCmdState = I2C_CMD_STA_ACK_POOLING; // Go to ACK polling to wait for write to complete - check when used
                            int acktest;

                            I2C2CONbits.PEN = 1;
                            while( !_MI2C2IF );
                            while( _MI2C2IF );
                            acktest = 1;
                            while( acktest )
                            {
                                I2C2CONbits.RSEN = 1;
                                while( !_MI2C2IF );
                                while( _MI2C2IF );
                                I2C2TRN = 0x00A0;
                                while( _TRSTAT );
                                acktest = I2C2STATbits.ACKSTAT;
                            }

                            I2C2CONbits.PEN = 1;
                            while( !_MI2C2IF );
                            while( _MI2C2IF );
                            psI2CData->jDone = 0;
                            //eI2CCmdState = I2C_CMD_STA_STOP;
                            I2C2CONbits.PEN = 1;
                            psI2CData->eI2CCmdState = I2C_CMD_STA_STOP_END;
                        }
                        else
                        {
                            //eI2CCmdState = I2C_CMD_STA_STOP;   // Close the Frame without ACK polling
                            I2C2CONbits.PEN = 1;
                            psI2CData->eI2CCmdState = I2C_CMD_STA_STOP_END;
                        }
                        
