devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP512GM710/i2cmem.c
                    }
                    else
                    {
                        //eI2CCmdState = I2C_CMD_STA_SEND_DATA;
                        if (psI2CData->u8I2CAddrSize == 2) /* 16-bit data MSB First */
                        {
                            if ((psI2CData->cntr & 1) == 0)
                            {
                                I2C2TRN = *( psI2CData->pI2CCmdBuffer + psI2CData->cntr + 1 );
                            }
                            else
                            {
                                I2C2TRN = *( psI2CData->pI2CCmdBuffer + psI2CData->cntr - 1 );
                            }
                        } 
                        else /* if (u8I2CAddrSize == 1) */
                        {
                            I2C2TRN = *( psI2CData->pI2CCmdBuffer + psI2CData->cntr );
                        }
                        psI2CData->eI2CCmdState = I2C_CMD_STA_SEND_DATA_ACK;//not needed state not changed
                        psI2CData->cntr = psI2CData->cntr + 1;
                    }
                }
            }

            break;
            
            
            
            
        /*==================================*/
        /* Read Data Phase                    */
        /*==================================*/
//        case I2C_CMD_STA_READ_DATA_START:
//            // Repeat Start
//            I2C2CONbits.RSEN = 1;
//            eI2CCmdState = I2C_CMD_STA_READ_DATA_CONTROL;
//            break;

        case I2C_CMD_STA_READ_DATA_CONTROL:
            // Re-send control byte with W/R=R
            if( psI2CData->jDone == 1 )
            {
                psI2CData->jDone = 0;
                psI2CData->eI2CCmdState = I2C_CMD_STA_READ_DATA_CONTROL_ACK;
                I2C2TRN = psI2CData->eI2CCmdCtrlByte | (0x0001);   /* Always read data request here */
            }
            break;

        case I2C_CMD_STA_READ_DATA_CONTROL_ACK:
            // Check, if control byte went ok
            if( psI2CData->jDone == 1 )
            {
                psI2CData->jDone = 0;

                if( I2C2STATbits.ACKSTAT == 1 )
                {                   // Ack Not received, Flag error and exit
                    //eI2CCmdState = I2C_CMD_STA_ERROR;
                    I2C2CONbits.PEN = 1;
                    psI2CData->eI2CCmdState = I2C_CMD_STA_ERROR_END;
                }
                else
                {
                    //eI2CCmdState = I2C_CMD_STA_READ_DATA_RECEIVE;
                    I2C2CONbits.RCEN = 1;
                    psI2CData->eI2CCmdState = I2C_CMD_STA_READ_DATA_RECEIVE_ACK;                    
                }
            }
            break;

//        case I2C_CMD_STA_READ_DATA_RECEIVE:
//            // Receive Enable
//            I2C2CONbits.RCEN = 1;
//            eI2CCmdState = I2C_CMD_STA_READ_DATA_RECEIVE_ACK;
//            break;

        case I2C_CMD_STA_READ_DATA_RECEIVE_ACK:
            // Receive data
            if( psI2CData->jDone == 1 )
            {
                psI2CData->jDone = 0;
                psI2CData->eI2CCmdState = I2C_CMD_STA_READ_DATA_RECEIVE_END;

                if (psI2CData->u8I2CAddrSize == 2) /* 16-bit data MSB First */
                {
                    if ((psI2CData->cntr & 1) == 0)
                    {
                        *( psI2CData->pI2CCmdBuffer + psI2CData->cntr + 1) = I2C2RCV;
                    }
                    else
                    {
                        *( psI2CData->pI2CCmdBuffer + psI2CData->cntr - 1) = I2C2RCV;
                    }
                } 
                else /* if (u8I2CAddrSize == 1) */
                {
                    *( psI2CData->pI2CCmdBuffer + psI2CData->cntr ) = I2C2RCV;
                }
                
                psI2CData->cntr++;

                if( psI2CData->cntr == psI2CData->u16I2CCmdSize )
                {
                    I2C2CONbits.ACKDT = 1;  // No ACK
                }
                else
                {
                    I2C2CONbits.ACKDT = 0;  // ACK
                }

                I2C2CONbits.ACKEN = 1;
            }
            break;

        case I2C_CMD_STA_READ_DATA_RECEIVE_END:
            if( psI2CData->jDone == 1 )
            {
                psI2CData->jDone = 0;
                if( psI2CData->cntr == psI2CData->u16I2CCmdSize )
                {
                    //eI2CCmdState = I2C_CMD_STA_STOP;
                    I2C2CONbits.PEN = 1;
                    psI2CData->eI2CCmdState = I2C_CMD_STA_STOP_END;
                }
                else
                {
                    //eI2CCmdState = I2C_CMD_STA_READ_DATA_RECEIVE;
                    I2C2CONbits.RCEN = 1;
                    psI2CData->eI2CCmdState = I2C_CMD_STA_READ_DATA_RECEIVE_ACK;
                }
            }
            break;

            
        /*==================================*/
        /* Stop Sequence                    */
        /*==================================*/
//        case I2C_CMD_STA_STOP:
//            I2C2CONbits.PEN = 1;
//            eI2CCmdState = I2C_CMD_STA_STOP_END;
//            break;

        case I2C_CMD_STA_STOP_END:
            if( psI2CData->jDone == 1 )
            {
                psI2CData->jDone = 0;
                eI2CCmd = I2C_CMD_IDLE;
                psI2CData->eI2CCmdState = I2C_CMD_STA_IDLE;
                psI2CData->cntr = 0;
                psI2CData->eI2CCmdCommand = I2C_CMD_IDLE;
            }

            break;

        /*==================================*/
        /* Set Error                         */
        /*==================================*/
//        case I2C_CMD_STA_ERROR:
//            I2C2CONbits.PEN = 1;
//            eI2CCmdState = I2C_CMD_STA_ERROR_END;
//            break;

        case I2C_CMD_STA_ERROR_END:
            if( psI2CData->jDone == 1 )
            {
                psI2CData->jDone = 0;
                eI2CCmd = I2C_CMD_IDLE;
                psI2CData->eI2CCmdState = I2C_CMD_STA_IDLE;
                psI2CData->rtrycntr = 0;
                psI2CData->cntr = 0;
                psI2CData->eI2CCmdCommand = 0xFFFF;
            }

            break;

