devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP512GM710/i2cmem.c
        /*==================================*/
        /* Stop Sequence                    */
        /*==================================*/
//        case I2C_CMD_STA_STOP:
//            I2C1CONbits.PEN = 1;
//            eI2CCmdState = I2C_CMD_STA_STOP_END;
//            break;

        case I2C_CMD_STA_STOP_END:
            if( psI2CData->jDone == 1 )
            {
                psI2CData->jDone = 0;
                eI2CCmd = I2C_CMD_IDLE;
                psI2CData->eI2CCmdState = I2C_CMD_STA_IDLE;
                psI2CData->cntr = 0;
                psI2CData->eI2CCmdCommand = I2C_CMD_IDLE;
            }

            break;

        /*==================================*/
        /* Set Error                         */
        /*==================================*/
//        case I2C_CMD_STA_ERROR:
//            I2C1CONbits.PEN = 1;
//            eI2CCmdState = I2C_CMD_STA_ERROR_END;
//            break;

        case I2C_CMD_STA_ERROR_END:
            if( psI2CData->jDone == 1 )
            {
                psI2CData->jDone = 0;
                eI2CCmd = I2C_CMD_IDLE;
                psI2CData->eI2CCmdState = I2C_CMD_STA_IDLE;
                psI2CData->rtrycntr = 0;
                psI2CData->cntr = 0;
                psI2CData->eI2CCmdCommand = 0xFFFF;
            }

            break;

        /*==================================*/
        /* Retry                             */
        /*==================================*/
//        case I2C_CMD_STA_RETRY:
//            I2C1CONbits.PEN = 1;
//            eI2CCmdState = I2C_CMD_STA_RETRY_END;
//            rtrycntr++;
//            break;

        case I2C_CMD_STA_RETRY_END:
            if( psI2CData->jDone == 1 )
            {
                psI2CData->jDone = 0;
                psI2CData->eI2CCmdState = I2C_CMD_STA_START_WAIT;
                I2C1CONbits.SEN = 1;
                psI2CData->cntr = 0;
            }

            break;

            /*==================================*/
            /* ACK Polling                        */
            /*==================================*/
//        case I2C_CMD_STA_ACK_POOLING:
//            int acktest;
//
//            I2C1CONbits.PEN = 1;
//            while( !_MI2C1IF );
//            while( _MI2C1IF );
//            acktest = 1;
//            while( acktest )
//            {
//                I2C1CONbits.RSEN = 1;
//                while( !_MI2C1IF );
//                while( _MI2C1IF );
//                I2C1TRN = 0x00A0;
//                while( _TRSTAT );
//                acktest = I2C1STATbits.ACKSTAT;
//            }
//
//            I2C1CONbits.PEN = 1;
//            while( !_MI2C1IF );
//            while( _MI2C1IF );
//            jDone = 0;
//            //eI2CCmdState = I2C_CMD_STA_STOP;
//            I2C1CONbits.PEN = 1;
//            eI2CCmdState = I2C_CMD_STA_STOP_END;
//            break;
            
            
//       case I2C_CMD_STA_END:
//            eI2CCmd = I2C_CMD_IDLE;
//            eI2CCmdState = I2C_CMD_STA_IDLE;
//            break;
            
//        case I2C_CMD_STA_IDLE:
//            break;
        default:
            eI2CCmd = I2C_CMD_IDLE;
            psI2CData->eI2CCmdState = I2C_CMD_STA_IDLE;
            break;
    }
}


#else   /* ISR or Non-ISR I2C Process Loop Driver Functions */
/******************************************************************************
 * I2C Non-ISR Related Functions
 *****************************************************************************/

void I2CMEM_vProcessRW(void)
{
    switch (eI2CCmdState)
    {
        /*==================================*/
        /* Control/Address Phase            */
        /*==================================*/
        case I2C_CMD_STA_START:
            // Start Condition
            I2C1CONbits.SEN = 1;
            eI2CCmdState = I2C_CMD_STA_START_WAIT;
            break;
        case I2C_CMD_STA_START_WAIT:
            // Start (Control) Byte with device select id
            if( jDone == 1 )
            {
                jDone = 0;
                //    I2C1TRN=(0x00A0)|(((i2cMem->oData->csel)&0x7)<<1);
                I2C1TRN = eI2CCmdCtrlByte & (~(0x0001));    /* Always Write command for Address */
                eI2CCmdState = I2C_CMD_STA_SEND_CTRL;
            }
            break;
       case I2C_CMD_STA_SEND_CTRL:
            // Send address byte 1, if ack is received. Else Retry
            if( jDone == 1 )
            {
                jDone = 0;

                if( I2C1STATbits.ACKSTAT == 1 )
                {                   // Ack Not received, Retry
                    if( rtrycntr < I2C_MAX_RETRY )
                    {
                        eI2CCmdState = I2C_CMD_STA_RETRY;
                    }
                    else
                    {
                        eI2CCmdState = I2C_CMD_STA_ERROR; // Flag error and exit
                    }
                }
                else
                {
                    rtrycntr = 0;
                    if (u8I2CAddrSize == 2)
                    {
                    //#if I2C_ADDRWIDTH == TWO_BYTE
                        I2C1TRN = (u16I2CCmdAddress)  >> 8;
                        eI2CCmdState = I2C_CMD_STA_SEND_ADDRESS_HI;
                    //#endif
                    }
                    else /* if (u8I2CAddrSize == 1) */
                    {
                    //#if I2C_ADDRWIDTH == ONE_BYTE
                        I2C1TRN = (u16I2CCmdAddress);
                        eI2CCmdState = I2C_CMD_STA_SEND_ADDRESS_LO;
                    //#endif
                    }
                }
            }
            break;
            
         case I2C_CMD_STA_SEND_ADDRESS_HI:
            // Send address byte 2, if ack is received. Else Flag error and exit
            if( jDone == 1 )
            {
                jDone = 0;

                if( I2C1STATbits.ACKSTAT == 1 )
                {                   // Ack Not received, Flag error and exit
                    eI2CCmdState = I2C_CMD_STA_ERROR;
                }
                else
                {
                    if (u8I2CAddrSize == 2)
                    {
                    //#if I2C_ADDRWIDTH == TWO_BYTE
                        I2C1TRN = ( (u16I2CCmdAddress) & 0x00FF );
                    //#endif
                    }
                    eI2CCmdState = I2C_CMD_STA_SEND_ADDRESS_LO;
                }
            }

            break;

        case I2C_CMD_STA_SEND_ADDRESS_LO:
            // Read or Write
            if( jDone == 1 )
            {
                jDone = 0;

                if( I2C1STATbits.ACKSTAT == 1 )
                {                   // Ack Not received, Flag error and exit
                    eI2CCmdState = I2C_CMD_STA_ERROR;
                }
                else
                {
                    if( eI2CCmdCommand == I2C_CMD_WR )
                    {
                        eI2CCmdState = I2C_CMD_STA_SEND_DATA;
                    }

