devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP512GM710/i2cmem.c
                    if( eI2CCmdCommand == I2C_CMD_RD )
                    {
                        eI2CCmdState = I2C_CMD_STA_READ_DATA_START;
                    }
                }
            }

            break;

        /*==================================*/
        /* Write Data Phase                    */
        /*==================================*/
        case I2C_CMD_STA_SEND_DATA:
            // Send data
            I2C1TRN = *( pI2CCmdBuffer + cntr );
            eI2CCmdState = I2C_CMD_STA_SEND_DATA_ACK;
            cntr = cntr + 1;
            break;

        case I2C_CMD_STA_SEND_DATA_ACK:
            // Look for end of data or no Ack
            if( jDone == 1 )
            {
                jDone = 0;
                eI2CCmdState = I2C_CMD_STA_SEND_DATA;

                if( I2C1STATbits.ACKSTAT == 1 )
                {                   // Ack Not received, Flag error and exit
                    eI2CCmdState = I2C_CMD_STA_ERROR;
                }
                else
                {
                    if( cntr == u16I2CCmdSize )
                    {               
                        eI2CCmdState = I2C_CMD_STA_STOP;   // Close the Frame without ACK polling
                        //eI2CCmdState = I2C_CMD_STA_ACK_POOLING; // Go to ACK polling to wait for write to complete
                    }
                }
            }

            break;
            
            
            
            
        /*==================================*/
        /* Read Data Phase                    */
        /*==================================*/
        case I2C_CMD_STA_READ_DATA_START:
            // Repeat Start
            I2C1CONbits.RSEN = 1;
            eI2CCmdState = I2C_CMD_STA_READ_DATA_CONTROL;
            break;

        case I2C_CMD_STA_READ_DATA_CONTROL:
            // Re-send control byte with W/R=R
            if( jDone == 1 )
            {
                jDone = 0;
                eI2CCmdState = I2C_CMD_STA_READ_DATA_CONTROL_ACK;
                I2C1TRN = eI2CCmdCtrlByte | (0x0001);   /* Always read data request here */
            }

            break;

        case I2C_CMD_STA_READ_DATA_CONTROL_ACK:
            // Check, if control byte went ok
            if( jDone == 1 )
            {
                jDone = 0;
                eI2CCmdState = I2C_CMD_STA_READ_DATA_RECEIVE;

                if( I2C1STATbits.ACKSTAT == 1 )
                {                   // Ack Not received, Flag error and exit
                    eI2CCmdState = I2C_CMD_STA_ERROR;
                }
            }

            break;

        case I2C_CMD_STA_READ_DATA_RECEIVE:
            // Receive Enable
            I2C1CONbits.RCEN = 1;
            eI2CCmdState = I2C_CMD_STA_READ_DATA_RECEIVE_ACK;
            break;

        case I2C_CMD_STA_READ_DATA_RECEIVE_ACK:
            // Receive data
            if( jDone == 1 )
            {
                jDone = 0;
                eI2CCmdState = I2C_CMD_STA_READ_DATA_RECEIVE_END;

                *( pI2CCmdBuffer + cntr ) = I2C1RCV;
                cntr++;

                if( cntr == u16I2CCmdSize )
                {
                    I2C1CONbits.ACKDT = 1;  // No ACK
                }
                else
                {
                    I2C1CONbits.ACKDT = 0;  // ACK
                }

                I2C1CONbits.ACKEN = 1;
            }

            break;

        case I2C_CMD_STA_READ_DATA_RECEIVE_END:
            if( jDone == 1 )
            {
                jDone = 0;
                if( cntr == u16I2CCmdSize )
                {
                    eI2CCmdState = I2C_CMD_STA_STOP;
                }
                else
                {
                    eI2CCmdState = I2C_CMD_STA_READ_DATA_RECEIVE;
                }
            }

            break;

            
        /*==================================*/
        /* Stop Sequence                    */
        /*==================================*/
        case I2C_CMD_STA_STOP:
            I2C1CONbits.PEN = 1;
            eI2CCmdState = I2C_CMD_STA_STOP_END;
            break;

        case I2C_CMD_STA_STOP_END:
            if( jDone == 1 )
            {
                jDone = 0;
                eI2CCmdState = I2C_CMD_STA_END;
                cntr = 0;
                eI2CCmdCommand = I2C_CMD_IDLE;
            }

            break;

        /*==================================*/
        /* Set Error                         */
        /*==================================*/
        case I2C_CMD_STA_ERROR:
            I2C1CONbits.PEN = 1;
            eI2CCmdState = I2C_CMD_STA_ERROR_END;
            break;

        case I2C_CMD_STA_ERROR_END:
            if( jDone == 1 )
            {
                jDone = 0;
                eI2CCmdState = I2C_CMD_STA_END;
                rtrycntr = 0;
                cntr = 0;
                eI2CCmdCommand = 0xFFFF;
            }

            break;

        /*==================================*/
        /* Retry                             */
        /*==================================*/
        case I2C_CMD_STA_RETRY:
            I2C1CONbits.PEN = 1;
            eI2CCmdState = I2C_CMD_STA_RETRY_END;
            rtrycntr++;
            break;

        case I2C_CMD_STA_RETRY_END:
            if( jDone == 1 )
            {
                jDone = 0;
                eI2CCmdState = I2C_CMD_STA_START;
                cntr = 0;
            }

            break;

            /*==================================*/
            /* ACK Polling                        */
            /*==================================*/
            int acktest;

        case I2C_CMD_STA_ACK_POOLING:
            I2C1CONbits.PEN = 1;
            while( !_MI2C1IF );
            while( _MI2C1IF );
            acktest = 1;
            while( acktest )
            {
                I2C1CONbits.RSEN = 1;
                while( !_MI2C1IF );
                while( _MI2C1IF );
                I2C1TRN = 0x00A0;
                while( _TRSTAT );
                acktest = I2C1STATbits.ACKSTAT;
            }

            I2C1CONbits.PEN = 1;
            while( !_MI2C1IF );
            while( _MI2C1IF );
            jDone = 0;
            eI2CCmdState = I2C_CMD_STA_STOP;
            break;
            
            
       case I2C_CMD_STA_END:
            eI2CCmd = I2C_CMD_IDLE;
            eI2CCmdState = I2C_CMD_STA_IDLE;
            break;
            
        case I2C_CMD_STA_IDLE:
            break;
        default:
            break;
    }
}
#endif  /* ISR or Non-ISR I2C Process Loop Driver Functions */


#endif  /* MCC use instead */



#ifndef BOARDCFG_USE_MCC_I2C    /* to do - write support MCC and FLIR */

#if USE_SPI_FLIR
/******************************************************************************
 * FLIR Related Functions
 *****************************************************************************/

void I2CMEM_vFlirProcessCmd(void)
{
    uint8_t* ps;
    uint8_t* pd;
    uint16_t* pd16;
    //uint16_t* ps16;
    uint16_t u16Size;
    uint16_t u16Data;
   
    switch (eFlirI2CSta)
    {
        case FLIR_I2C_STA_GET_STA_001:
            ps = (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_STA_LO;
            if (((*ps) & FLIR_BIT_POS_STA_LO_BUSY) != 0) /* check busy bit */
            {
                I2CMEM_vRead(I2C_CTRL_BYTE_FLIR, FLIR_ADR_REG_STA, (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_STA, 2, 2, u8I2CModule);
            }
            else
            {
                if (eFlirI2CCmd == FLIR_I2C_CMD_RD)
                {  
                    if (u16FlirI2CSize == 0)
                    {
                        eFlirI2CSta = FLIR_I2C_STA_ERR;
                    }
                    else
                    {
                        if (u8ReverseByteOrder0)
                        {
                            /* copy and fix MSB First */
                            pd = ((uint8_t*)&FLIRRegisters + FLIR_ADR_REG_LEN);
                            u16Data = u16FlirI2CSize;
                            *(pd + 0) = (uint8_t)(u16Data >> 8);
                            *(pd + 1) = (uint8_t)(u16Data >> 0);
                        }
                        else
                        {
                            pd16 = ((uint16_t*)&FLIRRegisters + FLIR_ADR_REG_16BIT_LEN);
                            *pd16 = u16FlirI2CSize;
                        }
                        
