devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP512GM710/i2cmem.c
                        eFlirI2CSta = FLIR_I2C_STA_SET_REG_CNT;
                        I2CMEM_vWrite(I2C_CTRL_BYTE_FLIR, FLIR_ADR_REG_LEN, (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_LEN, 2, 2, u8I2CModule);
                    }
                }
                else
                if (eFlirI2CCmd == FLIR_I2C_CMD_WR)
                {
                    if (u16FlirI2CSize == 0)
                    {
                        eFlirI2CSta = FLIR_I2C_STA_ERR;
                    }
                    else
                    {
                        if (u8ReverseByteOrder1)
                        {
                            /* copy and fix MSB First */
                            ps = (uint8_t*)pu8FlirI2CData;
                            pd = ((uint8_t*)&FLIRRegisters + FLIR_ADR_REG_D00);
                            u16Size = u16FlirI2CSize;
                            while(u16Size--)
                            {
                                *(pd + 0) = *(ps + 1);
                                *(pd + 1) = *(ps + 0);
                                ps += 2;
                                pd += 2;
                            }
                        }
                        else
                        {
                            ps = (uint8_t*)pu8FlirI2CData;
                            pd = ((uint8_t*)&FLIRRegisters + FLIR_ADR_REG_D00);
                            u16Size = u16FlirI2CSize*2;
                            while(u16Size--)
                            {
                                *pd++ = *ps++;
                            }
                        }
                    
                        eFlirI2CSta = FLIR_I2C_STA_SET_DAT_BUF;
                        I2CMEM_vWrite(I2C_CTRL_BYTE_FLIR, FLIR_ADR_REG_D00, (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_D00, u16FlirI2CSize*2, 2, u8I2CModule);
                    }
                }
                else
                if (eFlirI2CCmd == FLIR_I2C_CMD_RUN)
                {

                    if (u8ReverseByteOrder0)
                    {
                        /* copy and fix MSB First */
                        pd = ((uint8_t*)&FLIRRegisters + FLIR_ADR_REG_CMD);
                        u16Data = u16FlirI2CCommand;
                        *(pd + 0) = (uint8_t)(u16Data >> 8);
                        *(pd + 1) = (uint8_t)(u16Data >> 0);
                    }
                    else
                    {
                        pd16 = ((uint16_t*)&FLIRRegisters + FLIR_ADR_REG_16BIT_CMD);
                        *pd16 = u16FlirI2CCommand;
                    }
                    eFlirI2CSta = FLIR_I2C_STA_SET_CMD_REG;
                    I2CMEM_vWrite(I2C_CTRL_BYTE_FLIR, FLIR_ADR_REG_CMD, (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_CMD, 2, 2, u8I2CModule);
                }
            }
            break;
        case FLIR_I2C_STA_SET_REG_CNT:
            if((eFlirI2CCmd == FLIR_I2C_CMD_RD)
            || (eFlirI2CCmd == FLIR_I2C_CMD_WR))
            {
                    if (u8ReverseByteOrder0)
                    {
                        /* copy and fix MSB First */
                        pd = ((uint8_t*)&FLIRRegisters + FLIR_ADR_REG_CMD);
                        u16Data = u16FlirI2CCommand;
                        *(pd + 0) = (uint8_t)(u16Data >> 8);
                        *(pd + 1) = (uint8_t)(u16Data >> 0);
                    }
                    else
                    {
                        pd16 = ((uint16_t*)&FLIRRegisters + FLIR_ADR_REG_16BIT_CMD);
                        *pd16 = u16FlirI2CCommand;
                    }

                eFlirI2CSta = FLIR_I2C_STA_SET_CMD_REG;
                I2CMEM_vWrite(I2C_CTRL_BYTE_FLIR, FLIR_ADR_REG_CMD, (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_CMD, 2, 2, u8I2CModule);
            }
            break;
        case FLIR_I2C_STA_SET_CMD_REG:
            if((eFlirI2CCmd == FLIR_I2C_CMD_RD)
            || (eFlirI2CCmd == FLIR_I2C_CMD_WR)
            || (eFlirI2CCmd == FLIR_I2C_CMD_RUN))
            {
                eFlirI2CSta = FLIR_I2C_STA_GET_STA_002;  
                I2CMEM_vRead(I2C_CTRL_BYTE_FLIR, FLIR_ADR_REG_STA, (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_STA, 2, 2, u8I2CModule);
            } 
            break;
        case FLIR_I2C_STA_GET_STA_002:
            ps = (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_STA_LO;
            if (((*ps) & FLIR_BIT_POS_STA_LO_BUSY) != 0) /* check busy bit */
            {
                I2CMEM_vRead(I2C_CTRL_BYTE_FLIR, FLIR_ADR_REG_STA, (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_STA, 2, 2, u8I2CModule);
            }
            else
            {
                ps = (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_STA_HI;
                LEP_RESULT eLepResult = (LEP_RESULT)(*ps);
                if (eLepResult != 0)
                {
                    /* Error */
                    eFlirI2CSta = FLIR_I2C_STA_ERR;
                }
                else
                {
                    if (eFlirI2CCmd == FLIR_I2C_CMD_RD)
                    {
                        eFlirI2CSta = FLIR_I2C_STA_GET_DAT_BUF;
                        I2CMEM_vRead(I2C_CTRL_BYTE_FLIR, FLIR_ADR_REG_D00, (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_D00, u16FlirI2CSize*2, 2, u8I2CModule);
                    }
                    else
                    if((eFlirI2CCmd == FLIR_I2C_CMD_WR)
                    || (eFlirI2CCmd == FLIR_I2C_CMD_RUN))
                    {
                        eFlirI2CSta = FLIR_I2C_STA_IDLE;
                        //eFlirI2CSta = FLIR_I2C_STA_DONE;
                    }
                }
            }
            break;
        case FLIR_I2C_STA_GET_DAT_BUF:
            if (eFlirI2CCmd == FLIR_I2C_CMD_RD)
            {
                
                if (u8ReverseByteOrder2)
                {
                    /* copy and fix MSB First */
                    ps = ((uint8_t*)&FLIRRegisters + FLIR_ADR_REG_D00);
                    pd = (uint8_t*)pu8FlirI2CData;
                    u16Size = u16FlirI2CSize;
                    while(u16Size--)
                    {
                        *(pd + 0) = *(ps + 1);
                        *(pd + 1) = *(ps + 0);
                        ps += 2;
                        pd += 2;
                    }
                    
