devilreraser/fw_LIB_CSMON_clone/07_Archives/LIB_CSMON__corelite_no_fram/02_Libraries/Peripheral/01_Source/dsPIC33EP512GM710/i2cmem.c
                }
                else
                {
                    ps = (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_D00;
                    pd = pu8FlirI2CData;
                    u16Size = u16FlirI2CSize*2;
                    while(u16Size--)
                    {
                        *pd++ = *ps++;
                    }
                    
                }
                eFlirI2CSta = FLIR_I2C_STA_IDLE;
                //eFlirI2CSta = FLIR_I2C_STA_DONE;
            }
            break;
            
        case FLIR_I2C_STA_SET_DAT_BUF:
            if (eFlirI2CCmd == FLIR_I2C_CMD_WR)
            {
                if (u8ReverseByteOrder0)
                {
                    /* copy and fix MSB First */
                    pd = ((uint8_t*)&FLIRRegisters + FLIR_ADR_REG_LEN);
                    u16Data = u16FlirI2CSize;
                    *(pd + 0) = (uint8_t)(u16Data >> 8);
                    *(pd + 1) = (uint8_t)(u16Data >> 0);
                }
                else
                {
                    pd16 = ((uint16_t*)&FLIRRegisters + FLIR_ADR_REG_16BIT_LEN);
                    *pd16 = u16FlirI2CSize;
                }
                
                eFlirI2CSta = FLIR_I2C_STA_SET_REG_CNT;
                I2CMEM_vWrite(I2C_CTRL_BYTE_FLIR, FLIR_ADR_REG_LEN, (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_LEN, 2, 2, u8I2CModule);
            }
            break;
            
        case FLIR_I2C_STA_DONE:
            //eFlirI2CSta = FLIR_I2C_STA_IDLE;
            break;
        case FLIR_I2C_STA_ERR:
            break;
        default:
            //eFlirI2CSta = FLIR_I2C_STA_IDLE;
            break;
    }
}




void I2CMEM_vFlirRead(uint16_t u16Command, uint8_t* pdData, uint16_t u16Size, uint8_t u8I2CModule)
{
    if ((eFlirI2CSta == FLIR_I2C_STA_ERR) || (eFlirI2CSta == FLIR_I2C_STA_DONE))
    {
        eFlirI2CSta = FLIR_I2C_STA_IDLE;
    }

    if (eFlirI2CSta == FLIR_I2C_STA_IDLE)
    {
        eFlirI2CCmd = FLIR_I2C_CMD_RD;  
        eFlirI2CSta = FLIR_I2C_STA_GET_STA_001;  
        
        u16FlirI2CCommand = u16Command;
        /* Fix Command */
        u16FlirI2CCommand &= ~0x0001;
        u16FlirI2CCommand &= ~0x0002;
        
        pu8FlirI2CData = pdData;
        u16FlirI2CSize = u16Size;
        if (u16FlirI2CSize == 0)
        {
            u16FlirI2CSize = 1;
        }
        
        I2CMEM_vRead(I2C_CTRL_BYTE_FLIR, FLIR_ADR_REG_STA, (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_STA, 2, 2, u8I2CModule);
    }
}

void I2CMEM_vFlirWrite(uint16_t u16Command, uint8_t* pdData, uint16_t u16Size, uint8_t u8I2CModule)
{
    if ((eFlirI2CSta == FLIR_I2C_STA_ERR) || (eFlirI2CSta == FLIR_I2C_STA_DONE))
    {
        eFlirI2CSta = FLIR_I2C_STA_IDLE;
    }

    if (eFlirI2CSta == FLIR_I2C_STA_IDLE)
    {
        eFlirI2CCmd = FLIR_I2C_CMD_WR;  
        eFlirI2CSta = FLIR_I2C_STA_GET_STA_001;  
        
        u16FlirI2CCommand = u16Command;
        /* Fix Command */
        u16FlirI2CCommand |= 1;
        u16FlirI2CCommand &= ~0x0002;
        
        
        
        
        
        pu8FlirI2CData = pdData;
        u16FlirI2CSize = u16Size;
        if (u16FlirI2CSize == 0)
        {
            u16FlirI2CSize = 1;
        }

        I2CMEM_vRead(I2C_CTRL_BYTE_FLIR, FLIR_ADR_REG_STA, (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_STA, 2, 2, u8I2CModule);
    }
}

void I2CMEM_vFlirRun(uint16_t u16Command, uint8_t u8I2CModule)
{
    if ((eFlirI2CSta == FLIR_I2C_STA_ERR) || (eFlirI2CSta == FLIR_I2C_STA_DONE))
    {
        eFlirI2CSta = FLIR_I2C_STA_IDLE;
    }

    if (eFlirI2CSta == FLIR_I2C_STA_IDLE)
    {
        eFlirI2CCmd = FLIR_I2C_CMD_RUN;  
        eFlirI2CSta = FLIR_I2C_STA_GET_STA_001;  
        
        u16FlirI2CCommand = u16Command;
        /* Fix Command */
        u16FlirI2CCommand &= ~0x0001;
        u16FlirI2CCommand |= 2;
        
        //pu8FlirI2CData = pdData;
        //u16FlirI2CSize = u16Size;
        
        I2CMEM_vRead(I2C_CTRL_BYTE_FLIR, FLIR_ADR_REG_STA, (uint8_t*)&FLIRRegisters + FLIR_ADR_REG_STA, 2, 2, u8I2CModule);
    }
}


/* *****************************************************************************
 * I2CMEM_pFlirRegToIntRam
 * 
 * Description: Copy Data from external memory to internal RAM and 
 *              returns pointer to internal RAM
 **************************************************************************** */
HMDRV_ADDR I2CMEM_pFlirRegToIntRam(HMDRV_ADDR nSrcAddr, HMDRV_SIZE8 nSize)
{
    HMDRV_U16 addr = (HMDRV_U16)(HMDRV_ADDR_SIZE) nSrcAddr;
    HMDRV_U8* ps = pI2CFlirBufferRD;
    HMDRV_SIZE8 I2CModule = u8I2CModule;
    
    /* OEM or RAD command */
    if (addr >= 0x0800)  
    {
        addr |= (1 << 14);
    }

    u16FlirI2CCommandReq = addr;

    while(eI2CCmd == I2C_CMD_BUSY){;} /*  wait pending transfer */  
    I2CMEM_vFlirRead(u16FlirI2CCommandReq, pI2CFlirBufferRD , nSize, I2CModule);
    while(eI2CCmd == I2C_CMD_BUSY){;} /*  wait pending transfer */
    
    return (HMDRV_ADDR)ps;
}
/* *****************************************************************************
 * I2CMEM_pFlirRegFromIntRam
 * 
 * Description: returns pointer to internal RAM for 
 *              Copy Data to Flir Register from internal RAM 
 *              
 **************************************************************************** */
HMDRV_ADDR I2CMEM_pFlirRegFromIntRam(void)
{
    HMDRV_U8* pb = pI2CFlirBufferWR;
    return (HMDRV_ADDR)pb;
}

/* *****************************************************************************
 * I2CMEM_vFlirRegFromIntRamCopyData
 * 
 * Description: Copy Data to external memory from already filled internal RAM buffer
 **************************************************************************** */
void I2CMEM_vFlirRegFromIntRamCopyData(HMDRV_ADDR nDestAddr, HMDRV_SIZE8 nSize)
{
    HMDRV_U16 addr = (HMDRV_U16)(HMDRV_ADDR_SIZE) nDestAddr;
    HMDRV_SIZE8 size = nSize;
    HMDRV_SIZE8 I2CModule = u8I2CModule;
    HMDRV_U16 RequestType;
    
    /* OEM or RAD command */
    if (addr >= 0x0800)  
    {
        addr |= (1 << 14);
    }

    u16FlirI2CCommandReq = addr;
    
    

    
    while(eI2CCmd == I2C_CMD_BUSY){;} /*  wait pending transfer */
    RequestType = (addr & 0x0003);
    if (RequestType == 0x02)    /* Run */
    {
        I2CMEM_vFlirRun(u16FlirI2CCommandReq, I2CModule);
    }
    else  /* Set for any other address */
    {
        I2CMEM_vFlirWrite(u16FlirI2CCommandReq, pI2CFlirBufferWR, size, I2CModule);
    }
    
    
}
#endif  /* FLIR */

#endif /* MCC */
